export default {
  name: "高级全球太鼓比赛",
  description:
    "高级全球太鼓比赛是一个给高级玩家的2v2比赛。所有参赛者的排名必须在#500到#3500之间。预赛过后排名头32的队伍将会进入小组赛，其中的16强将会进入双重淘汰赛。",
  discord: "https://discord.gg/3mGC3HB",
  homepage: [
    {
      title: "限制",
      body: `这个比赛容许任何排名在#500到#3500之间，并且在最近12个月之内没有被限制的玩家参加。osu!职员有在筛查阶段后禁止玩家参与比赛的权利。`,
    },
    {
      title: "日期",
      body: `
### 报名期段
8月16日-8月30日
### 筛查阶段
8月30日 - 9月6日
### 预赛 
9月12日 – 9月13日
### 小组赛阶段
9月19日 – 9月20日
### 16强+ 败者组别 – 第1轮
9月26日 – 9月27日
### 八强赛 + 败者组别 – 第2轮
10月3日 – 10月4日
### 半决赛 + 败者组别 - 第3轮和第4轮
10月10日 – 10月11日
### 获胜者支架决赛 + 败者复活决赛和总决赛
10月17日 – 10月18日
### 精英赛 + 总决赛
10月24日 – 10月25日`

    },
    { title: "报名", body: "请使用你的osu!账户登入，然后按下「报名」的按钮。最后，请按下Discord按钮加入我们的伺服器。**所有参赛者必须进入伺服器，否则将会被取消比赛资格。**" }, 
    {
      title: "奖品",
      body: `
- **第一名:** 个人资料页徽章 (待确认)，十六个月的osu!支持者，由Foxbox特制的滑鼠垫
- **第二名:** 一年的osu!支持者
- **第三名:** 两个月的osu!支持者`
    },
  ],
  rules: `
   #一般规则
- 这个比赛是一个**二比二 团队比赛**，一个团队能有**最多 5 名玩家**.
- 团队会将首先经过**预赛**， 然后进入**小组赛**,最后才进入**双重淘汰赛。**
-我们将使用**Score V2**作为得分系统。
- 如果您符合规定的要求，您就可以参加比赛。但是，因为我们这场比赛可能会派发胜者徽章，有些玩家可能会被osu!的职员拒绝参赛。 
-除了**组织者, 谱面选择人士和裁判员**之外，所有职员都可以参加比赛。
-玩家和职员必须彻底阅读规则。（我们会假设您在比赛整个过程中已经彻底了解这些规则。）
-每个玩家必须尊重所有玩家和职员，以及保持适当的态度。如果您不遵守这条规则，您有可能会被禁赛。这条规则也适用于所有的职员。
-任何规则改变或者意外事件会在这个论坛帖子和Discord的服务器公布。

# 比赛注册和团队创造
 - 如果您想报名参加我们的比赛，您必须排名在#500-#3500之间。
 - 玩家将会独自报名参加。当我们接受玩家的注册，我们会在Discord的伺服器中分配您的国家队身份组
 -如果职员决定了玩家的技能超过这个比赛针对的玩家的能力，职员可以拒绝玩家参与比赛。
 -今年，我们允许每个国家在下列的条件下组建2支团队。
	- 您的国家有**超过7名玩家**报名。
	- 每个团队需要**最少3名玩家。**
- 由于之前的规则，创建团队有可能会遇到不同的情况：
	- 如果一个国家有5名（或更少）玩家报名参加，这些玩家将组成代表他们国家的团队。
	- 如果一个国家有超过10名玩家报名参加，将会由参赛者自行决定10名出赛的玩家。如果参赛者未能在限定时间内决定，在参赛者中排名头十位的玩家将会组成两只队伍。
	- 如果一个国家有6名玩家报名参加，将会由参赛者选出5位玩家出赛。如果参赛者未能在限定时间内决定，在参赛者中排名头五位的玩家将会组成队伍。
	- 如果一个国家有7-10名玩家报名参加，国家的玩家有几天的时间（准确日期会之后宣布）决定怎么分成两只队伍。
	我们建议玩家们尽快分成两个团队，然后决定队长，以及能够在最短时间内调整比赛时间和准备比赛。
	- 如果玩家们无法达成协议，我们会用PP排名玩家，把玩家安排在两个有至少3名玩家的团队，pp排名最高的玩家会在第1团队，其余的玩家会在第2团队。
- 玩家们会决定团队的队长。
- 如果玩家们不能选一名队长，我们将选出择排名最高的玩家当作队长。
- 如果团队需要改期任何的组赛，队长将会是负责人。队长也必须确保他的队友在场比赛。
 
# 阶段规则
 - 这个比赛中将有7个阶段：预赛，小组，16强，八强赛 ，半决赛 ，决赛和总决赛。
 - 我们将使用团队在预赛中的结果分成队伍，将团队分为4个类别中的1个：顶级类别，高级类别，中级类别和低级类别。
 - 我们将于9月13日，星期天在Twitch 的频道播放随机选择**8个小组进行小组比赛，每个小组中会有四支队伍。** 
 - 在团队阶段，每个小组的所有团队都会相互竞争。**成绩最好的2支团队**将会进入16强。 
 - 每个团队的排名将使用以下的资料来确定的（资料按优先级排序）：
	-赢最多的组赛。
	-最高 (获胜谱面的数量减去落败谱面的数量)比分。
	-赢最多的谱面。
	-如果有两个点数相同的团队，我们会使用这两个团队在之前比过的组赛赢者。 
	-在团队阶段，“自动胜出”将被视为5:0 的赢，加1:0点数差异比率。
 - 每个阶段的胜利条件是:
	-小组赛: 9局5胜(赢 5 个谱面)
	-16强 + 八强赛 + 败者组别 – 第1和第2轮: 11局6胜(赢 6 个谱面)
	-半决赛，决赛，总决赛和败者组别 - 第3轮和第4轮： 13局7胜(赢 7个谱面)

# 预赛规则
- 在这轮比赛中，会在不同时间有房间建立。
- 一个私有比赛会被建立，然后队伍会在预定的时间被邀请到房间中。请确保你准时在线上。
- 本轮将不会有热身。
- 失败的成绩将会算进比赛成绩。
- 每个谱子将有团队中的两名玩家出赛。参赛者可随意改变出赛玩家。
- 排名将会由所有谱子的平均排名组成。
- 玩家会把每个谱子都打两次。分数较高的那轮将会被使用来排名。
- 排名最高的32支队伍将会进入小组赛。

# 小组赛+淘汰赛规则
- 在团队组赛的十分钟之前，裁判员将建立新房间。到了比赛时间时，裁判员将邀请两个队长进入房间，之后裁判员或者队长将邀请团队的其他玩家进入房间。
- 如果没有裁判员或者职员监视组赛，组赛会被延迟举行。
- 如果某个团队有少过两名玩家比组赛，组赛可以延迟最多十分钟。
- 在比赛时间时如果不能准时进入房间，只要在约定时间后十分钟内到达，将不会被惩罚。
- 如果两个团队皆没有足够玩家比赛： 在团队阶段之内， 这两个团队会再团队赛中视为输掉比赛。在淘汰赛中，在预赛中排名最高的团队会进入下一轮。
- 这个比赛会使用TeamVs和ScoreV2。 游戏房间的名称必须是 : "AGTS 2020: (红队) vs (蓝队)"。
- 每个团队能选择1张谱面当作热身。这张谱面不能超过3分钟。所有参赛者可以进入房间里打热身的谱面。
- 如果一个队伍需要多于两分钟选出热身的谱子，裁判员将会略过该队的热身谱面
- 每个队长必须选择禁用**1张谱面，**这张谱面不能在该场比赛之内被选择。 (除了决胜局谱面)
- 每个团队的队长会以在频道发”!roll”的讯息来掷骰子。
- 得到更高数的团队将会**优先选择要打的谱子**. 得到更低数的团队**优先禁止一张谱子*.
- 每队的队长将会有两分钟选择要禁用的谱子。如果未能在两分钟内选出，禁用的谱子将会被随机选择
- 两个队长之间交替从谱面池选择谱面。
- 除了决胜局之外，团队能自由挑选从所有种类里面的谱子。
- 队伍将会有两分钟选择谱子，以及两分钟准备比赛。如果队伍未能在两分钟内选择一张谱子，谱子将会随机决定。
- 在比赛期间，交替玩家没有限制。
- 如果有玩家在谱面选择时候网络断线，而且团队没有别的玩家能代替断线的玩家，组赛能够延迟最多10分钟。
- 如果玩家在玩谱面中断线，所得分数会视为没有及格。
- 如果1名玩家在铺面开始的30秒之内断线，裁判员将允许两只队伍重打谱面。（每只团队在每个比赛只能使用这条规则一次.）
- 即使玩家在谱面失败了，他的得分还是会计入总数。
- 如果两只队伍在谱面中得分相同，队伍必须重打谱面。
- 如果点数相同(假如:在9决5胜中，得分为 4-4), 决胜局谱面将会被选。

# 图谱池指示
- 比赛中的每个阶段将有一个谱面池：预赛，小组分赛，16强赛，八强赛 ，半决赛 ，决赛和总决赛。精英赛将使用另外一个铺池。 (详细资料请阅读精英赛规则)。
- 预赛的铺池格式会与其他阶段不同。预赛铺池会包括2张NoMod, 1张Hidden, 1张HardRock 以及1张DoubleTime 谱子。
- 胜者组别和败者组别将使用同样的谱面池。并且与胜者组别赛在同一个周末比赛。
- 每个谱面池会有6个类别：NoMod, Hidden, HardRock, DoubleTime, FreeMod 和 Tiebreaker.
- 团队阶段的谱面池将有14张谱面。 16强和八强赛的谱面池将有15张谱面。半决赛 ，决赛和总决赛的谱面池将有16张谱面。
- 直到半决赛，Hidden, HardRock和DoubleTime的支架将有两张谱面，之后将增加到3个图谱。FreeMod的支架在所有阶段都会有3张图谱。
- FreeMod的谱面池会使用FreeMod。每个玩家能够选择使用**Hidden, HardRock 或者Hidden-HardRock**。**在每个团队之内必须至少一名玩家使用至少一个Mod.**
- 决胜局谱面会使用 FreeMod 来比赛，但是玩家不必使用Mod。 
- 每个阶段的谱面池会一个礼拜之前在Twitch 的频道直播。

# 时间安排规则
- 每个阶段会在**周末**比赛。(但是，如果两个团队皆不能在周末比赛，比赛可改到其他日子举行。)
- 如果有足够的裁判员，将可以安排两个比赛同时进行。
- 我们将尽量考虑时区而安排最好的时间比组赛。时间表将在每个阶段的前一个周末发布。
- 改期只能在两组都同意的请况下被安。两个团队必须在那个礼拜的**星期四23:59 UTC + 0**之前决定新的时间，以及加以证据通知职员。 
- 只有**队长**才能要求改期。

# 精英赛规则
- 精英赛是一个轻松的比赛，会跟总决赛在同一个周末举行。这场比赛是让整个比赛中最优秀的玩家展示自己的才能。
- 8位玩家将会以投票形式选出比赛。
- 票数最高的8位玩家将会参加精英赛。如果同一个国家中有多于两位参赛者被选中，只有在那个国家票数最高的两位玩家才能参加精英赛。
- 票数最高的两位玩家将会成为队长。其他队员会已得票数决定。排名第1，3，5，7的玩家将组成一队，而排名第2，4，6，8的玩家将组成另一队。
- 精英赛将以4v4形式进行，并跟从以下规则：
	- 比赛将会以十五局8胜形式举行。
	- 铺池将会有20张Freemod铺面以及1张决胜铺面。所有谱子可使用任何mod(或者mod组合）。但是，有些谱子会有可能加上mod后变得几乎不可能打！
	- 比赛前不能禁用任何谱子。
	- 选择谱子的方式将会跟正常比赛的形式举行。
	- 玩家网络断线将会跟正常比赛的形式处理。
   `,
};