export default {
  name: "Expert Global Taiko Showdown",
  description:
    "Expert Global Taiko Showdownはトッププレイヤーを対象する、ランク制限のない１対１大会です。予選ラウンド後で上位64位の選手が、熱いダブル・イリミネーション方式のブラケットで対戦します。",
  links: [
    {
      label: "Discord",
      link: "https://discord.gg/3mGC3HB"
    },
    {
      label: "Challonge",
      link: "https://challonge.com/EGTS2025"
    },
    {
      label: "Pick'ems",
      link: "https://pickem.hwc.hr/tournaments/159"
    },
    {
      label: "Twitch",
      link: "https://twitch.tv/gtsosu"
    },
  ],
  homepage: [
    {
      title: "大会制限",
      body: `ランク、国籍などの制限がありません。大会参加に禁じられていない限り、osu!taikoのプレイヤーの皆様の中に誰でも参加できます。osu!サポートチームの裁量でスクリーニング時期後に選手を大会から外すことができるものとします。`,
    },
    {
      title: "日程",
      body: `
### 登録時期
1月5日～1月19日
### スクリーニング時期
1月19日～2月2日
### 予選ラウンド
2月8日～2月9日
### 64選手ラウンド
2月15日～2月16日
### 32選手ラウンド＋敗者ブラケットその１
2月22日～2月23日
### 16選手ラウンド＋敗者ブラケットその２・その３
3月1日～3月2日
### 準々決勝＋敗者ブラケットその４・その５
3月8日～3月9日
### 準決勝＋敗者ブラケットその６・その７
3月15日～3月16日
### ファイナル＋敗者ブラケットその８・敗者ファイナル
3月22日～3月23日
### 敗者ブラケット決勝戦・大会決勝戦
3月29日～3月30日`,
    },
    {
      title: "登録",
      body: "osu!アカウントにログインしてから、上の登録ボタンを押してください。さらに、Discordボタンを押して、大会サーバーに参加してください。**大会参加には、Discordサーバーに参加することが必要です。サーバーに参加しない場合、大会から外されるものとします。**",
    },
    {
      title: "賞品",
      body: `
- **一位:** osu!プロフィール記章（未決）
- **二位:** osu!プロフィール記章（未決）
- **三位:** osu!プロフィール記章（未決）`,
    },
  ],
  rules: `
# ルール
- この大会は、**1対1ダブル・イリミネーション方式大会です。**
- 使用されるスコアシステムは**Score V2**になります。
- 上記の「大会制限」にある条件を満たしている選手の皆様は誰でも登録できます。
本大会は記章の取得を狙っているつもりなので、スクリーニング時期後にosu!スタッフが選手をお断りする可能性があります。
- スタッフの皆様が大会に参加を希望する場合、**解説者**、または**配信者**のみが参加できます。
- 選手、及びスタッフは、このルールを完全に読んでいる必要があります。大会中、読んでいたものとみなします。
- 参加者は敬意をもって行動しなければなりません。このルールに違反した場合、大会への参加が禁じられる可能性があります。このルールは、スタッフの皆さんにも適用されます。
- ルールの変更、または予期せぬ事態が発生した場合は、Discordサーバーでお知らせします。

# ステージ規則
- この大会は、予選・64選手ラウンド・32選手ラウンド・16選手ラウンド・準々決勝・準決勝・ファイナル・決勝戦の8ラウンドで構成されています。
- 予選ラウンドにおける各マップの平均ランクによって、ブラケットに振り分けられます。
- 各ラウンドの勝利条件は以下の通りです：
    - 64選手ラウンド：　9ポイント勝負（先5ポイント獲得選手）
    - 32選手ラウンド、16選手ラウンド、準々決勝＋敗者ブラケットその１～その５：　11ポイント勝負（先6ポイント獲得選手）
    - 準決勝、ファイナル、決勝戦＋敗者ブラケットその６～敗者ブラケット決勝戦：　13ポイント勝負（先７ポイント獲得選手）
    - *決勝戦は、勝者ブラケットで勝ち上がった選手が1ラウンド（13ポイント勝負）取れば優勝となります。一方、敗者ブラケットで勝ち上がった選手は2ラウンド取れば優勝となります。*
   
# 予選ラウンドへの規則
 - 予選ラウンド中、週末を通じて特定の時間帯にマルチのロビーが開設されます。
 - 選手は、サイトにログインしてから「スケジュール」タブでロビーを選択した後、ロビーの予定表に参加できます。
 - プライベートマッチが制作され、選手は合意された時間にロビーに招待されます。その時間にオンラインであるよう、お願いいたします。
 - ウォームアップはありません。
 - マップは、ロビー中で2回連続してプレイされます。選手のベストスコアのみが、ランキングに考慮されます。
 - 各マップで各選手の平均ランクによって、ブラケット振り分けが決定されます。 
 - 予選ラウンドのトップ64選手のみがブラケットステージに進めます。

# マッププール説明
- 以下の各ラウンドは、1つのマッププールが用意されます：予選ラウンド、64選手ラウンド、32選手ラウンド、16選手ラウンド、準々決勝、準決勝、ファイナル、決勝戦。
- 大会で使用されているすべての楽曲は、アーティストの許可で使用しているか、または[osu!注目アーティスト](https://osu.ppy.sh/beatmaps/artists)の楽曲の一部です。
- 敗者ブラケット試合は、同じ週末の勝者ブラケット試合と同じマッププールで行われます。
- 各マッププールは、6つのブラケットで構成されます：**NoMod、Hidden、Hard Rock、Double Time、ForceMod、タイブレーカー**。予選ラウンドプールはタイブレーカーはありません。
- 予選ラウンドのマッププールは10マップがあります。64選手ラウンドのマッププールは14マップがあります。32選手ラウンド～準々決勝の各ラウンドのマッププールは15マップがあります。準決勝～決勝戦の各ラウンドのマッププールは16マップがあります。
- NoModブラケットのサイズは、予選ラウンドで3マップ、64選手ラウンドで4マップ、32選手ラウンド～準々決勝で5マップ、準決勝～決勝戦で6マップになります。
- Hidden、Hard Rock、Double Timeのブラケットのサイズは全大会中で2マップになります。
- ForceModブラケットのサイズは、予選ラウンドで1マップ、それ以外の大会で3マップになります。
- ForceModプールはFreeModを有効にして行います。すべての選手はHidden、Hard Rock、またはその両方を選択するのは必要です。
- タイブレーカープールはFreeModを有効にして行いますが、選手はModを選択する必要はありません。
- 各ラウンドのマッププールは、試合が行われる1週間前に紹介されます。

# 予定表説明
- 全ラウンドは**週末中**に行われます。（週末に都合のいい時間が見つからず、レフェリーが確保できる場合は、別の日に試合を行うことも可能です。）
- 両選手の時間帯に合わせてマッチをスケジュールするようにします。予定表は各ラウンドの前週末に発表されます。
- 延期は、両選手について合意した場合のみ認められます。延期は、**試合が行われる週末の木曜23時59分（UTC時間帯）**までに行われ、大会主催者に通知される必要があります。

# マッチ規則
- 試合の10分前に、レフェリーによってプライベートロビーが制作されます。試合時間になると両選手はそのロビーに招待されます。 
- スタッフやレフェリーがいない場合は、試合は延期されます。
- どちらの選手が遅刻した場合、試合は最大でも10分で延期されます。
- 延期された許容時間内にロビーに参加する限り、遅刻した選手にペナルティはありません。
- 10分を経過してもどちらの選手がロビーに参加しなかった場合、ブラケットランクが最も高い選手が次のラウンドに進みます。
- 試合は1対1モードとScore V2モードで行われ、ロビーの名前を「EGTS 2025: (赤選手) vs (青選手)」にする必要があります。
- ウォームアップはありません。
- 各選手はチャット内に「!roll」というコマンドでロールします。
- **最も高い番号を出した選手**は**最初マップを選択、最後にマップを禁止します。**　**最も低い番号を出した選手**は**最初にマップを禁止、最後にマップを選択します。**
- 各選手は、プールから**1つのマップ**を禁止するのは必要です（タイブレーカー除外）。禁止されたマップは全試合中にどちらの選手も選択できません。
- 各選手は2分以内にマップを禁止する必要があります。2分経っても禁止を発表しない場合、「!roll」というコマンドでマップが禁止されます。
- 禁止時期後、勝敗が決まるまで、選手はマッププールから順番にマップを選択します。
- 選手はどのModブラケットでも自由にマップを選択できます。
- 選手は2分間でマップを選択し、2分間で準備をします。タイマーが終了する前に選手がマップの選択を発表しなかった場合、「!roll」というコマンドでマップが選択されます。タイマー終了時に両選手が準備できていない場合、例外なくマッチが開始されます。
- 選手がマッププレイ外に接続を切断した場合、試合は最大に10分延期できます。この延期は一度しか行いません。
- マッププレイ開始30秒後に切断した場合、そのマップの敗者に決定します。
- マッププレイ開始後30秒以内に切断された場合、再戦をリクエストできます。これは1人の選手につき1回のみ認められます。
- 全マップでNo Failが使用されます。ForceModやタイブレーカー等のブラケットでNo Failの有効を忘れた場合、失敗したスコアが認められます。 
- マッププレイ結果が引き分けの場合、そのプレイは認められず、マップを再プレイされます。2回目の結果も引き分けの場合、そのプレイも認められず、マップを選択した選手は別のマップを選択しなければなりません。
- 試合ポイントが同点の場合（例えば9ポイント勝負で4ポイント対４ポイント）、タイブレーカーマップが選択されます。
- ルールにないものは、大会スタッフの判断に委ねるものとします。
 `,
};
