export default {
  name: "Expert Global Taiko Showdown",
  description:
    "Expert Global Taiko Showdown, наш 1v1 турнир для лучших игроков тайко, хотя ограничений по рейтингу нет. Топ 128 по результатам квалификации встретятся в напряжённой сетке c выбыванием после двух поражений.",
  discord: "https://discord.gg/3mGC3HB",
  homepage: [
    {
      title: "Ограничения",
      body: `Нету никаких ограничений по рейтингу или странам. Любой игрок osu!taiko, который не был забанен за последние 12 месяцев, может принять участие в турнире. osu! стафф имеют право отстранить любого игрока от турнира после скрининга.`,
    },
    {
      title: "Даты",
      body: `
### Период регистрации
С 3-го мая по 17-е мая.
### Скрининг
С 17-го мая по 24-е мая.
### Квалификация
С 30-го мая по 31-е мая.
### 1/64 финала + Сетка лузеров Раунд 1
C 6-го июня по 7-е июня.
### 1/32 финала + Сетка лузеров Раунд 2
C 13-го июня по 14-е июня.
### 1/16 финала + Сетка лузеров Раунды 3 и 4
C 20-го июня по 21-е июня.
### 1/8 финала + Сетка лузеров Раунды 5 и 6
C 27-го июня по 28-е июня.
### Четвертьфинал + Сетка лузеров Раунды 7 и 8
C 4-го июля по 5-е июля.
### Полуфинал + Сетка лузеров Раунды 9 и 10
C 11-го июля по 12-е июля.
### Финал, и в Сетке лузеров Финал и Гранд Финал
C 18-го июля по 19-е июля.
### Гранд Финал
C 25-го июля по 26-е июля.`,
    },
    {
      title: "Регистрация",
      body:
        "Пожалуйста, нажмите на кнопку регистрации выше, после того как вы вошли под своим osu! аккаунтом, а затем нажмите на кнопку Discord, чтобы войти на сервер турнира. **Быть на Discord сервере обязательно для участия в турнире, иначе вы будете исключены из него.**",
    },
    {
      title: "Призы",
      body: `
- **1-е место:** значок на профиль osu! (ещё не подтверждено), $66 или 1 год osu!supporter, и коврик для мыши с GTS тематикой, сделанный [Foxbox](https://foxbox.io)
- **2nd place:** $36 или 6 месяцев osu!supporter, и коврик для мыши с GTS тематикой, сделанный [Foxbox](https://foxbox.io)
- **3rd place:** $28 или 2 месяца osu!supporter, и коврик для мыши с GTS тематикой, сделанный [Foxbox](https://foxbox.io)`,
    },
  ],
  rules: `
# Основные правила
- Турнир проводится в формате **1v1 с сеткой с выбыванием после двух поражений.** 
- Игроки сначала проходят квалификацию, а затем 128 лучших игроков будут играть в **сетке с выбыванием после двух поражений.**
- Очки считаются по системе **Score V2.**
- Игроки, помогающие в организации турнира, также могут принять участие, за исключением **Организаторов**, **Маппулеров** и **Рефери**.
- Игроки и помощники огранизаторов должны целиком прочитать данные правила (и на всём протяжении турнира мы будем подразумевать, что вы их прочитали).
- Все участники должны быть доброжелательными и относится с уважением друг к другу. Не соблюдение данного правила может привести к бану/занесению в чёрный список турнира. Данное правило касается и помощников организаторов.
- Все изменения в правилах и неожиданные ситуации будут объявлены в данной теме и в Discord сервере.

# Правила стадий турнира
- Всего в турнире 9 стадий: Квалификация, 1/64 финала, 1/32 финала, 1/16 финала, 1/8 финала, Четвертьфинал, Полуфинал, Финал и Гранд Финал.
- Все игроки будут распределены по среднему, взятому из их мест на каждой карте квалификации.
- В случае, если игроков будет больше 128-ми, то 128 лучших по результатам квалификации продолжат участие в турнире.
- Условия победы в каждой стадии турнира:
    - 1/64 финала, 1/32 финала, 1/16 финала, 1/8 финала: Best-Of-9 (первый до 5 побед)
    - Четвертьфинал: Best-Of-11 (первый до 6 побед)
    - Полуфинал, Финал и Гранд Финал: Best-Of-13 (первый до 7 побед)
   
# Правила квалификации
- Во время этого раунда будет доступно несколько лобби в разное время.
- Будет создан приватное лобби и команды получат приглашение в него, когда настанет время матча. Обязательно будьте в сети в это время.
- Карты разминки не будет.
- Распределение игроков будет произведено по среднему, взятому из их мест на каждой карте.
- Все карты будут сыграны два раза. В зачёт пойдёт лучшая попытка.
- 128 лучших игроков пройдёт в следующий этап.
# Правила, касающиеся маппула
- Для данных стадий турнира будет по 1-му маппулу: Квалификация, 1/64 финала, 1/32 финала, 1/16 финала, 1/8 финала, Четвертьфинал, Полуфинал, Финал и Гранд Финал.
- Сетка лузеров будет проходить на том же пуле, как и Сетка победителей той же недели.
- Пул квалификаций будет отличаться от остальных стадий, и состоять из 2 NoMod, 1 Hidden, 1 HardRock и 1 DoubleTime карт.
- Каждый маппул состоит из 6 частей: **NoMod, Hidden, HardRock, DoubleTime, FreeMod, и Tiebreaker**.
- Маппулы с 1/64 финала по 1/8 финала будут состоять из 14 карт, маппул Четвертьфинала - из 15 карт, маппулы Полуфинала, Финала и Гранд Финала - из 19 карт.
- Размер NoMod пула будет 4 с 1/64 финала по 1/8 финала, 5 в Четвертьфинале, и 6 с Полуфинала по Гранд Финал.
- Размер Hidden, Hard Rock и Double Time пулов будет по 2 с 1/64 финала по Четвертьфинал, и 3 с Полуфинала по Гранд Финал.
- Размер FreeMod пула будет 3 на протяжении всего турнира.
- FreeMod пул играется с активированным FreeMod. Игроки могут использовать [b]Hidden, HardRock, или оба вместе[/b]. **Каждый игрок должен выбрать хотя бы один мод.**
- Tiebreaker будет играться с FreeMod, но мод выбирать не обязательно.
- Маппул каждой стадии будет показан за неделю до матчей.

# Правила расписания матчей
- Каждая стадия будет проводиться **по выходным**. Если во время выходных нет удобного времени для матча, разрешено провести его в другой день.
- Мы будем стараться выбирать лучшее время в соответствии с часовыми поясами команд. Расписание будет выложено за неделю до стадии.
- Перенос матча будет рассмотрен, если оба игрока согласятся с новым временем. Это должно произойти и быть сообщено организаторам до Четверга в 23:59 UTC+0 той недели, на которой проводится матч.

# Правила проведения матчей
- Рефери создаст приватное лобби за 10 минут до начала. Оба игрока получат приглашение, когда наступит время матча.
- Если ни один рефери или организатор не будет присутствовать, то матч будет отложен.
- Если один из игроков опаздывает, то матч может быть задержан максимум на 10 минут.
- Если игрок присоединился к лобби в пределах дополнительного времени, никакого пенальти не будет.
- Если ни один из игроков не будет в лобби спустя 10 минут, то игрок с высшим результатом на квалификации пройдёт дальше по сетке.
- Матч будет проводиться в режиме Head to Head и ScoreV2 и название комнаты должно быть: "EGTS 2020: (Красный Игрок) vs (Синий игрок)".
- Каждый игрок может выбрать одну карту разминку, но она должна быть короче 4-х минут. 
- Если игрок дольше 2-х минут выбирает разминку, рефери пропустит её.
- Каждый игрок должен забанить **одну карту** из маппула (кроме Tiebreaker). Эти карты будут недоступны для выбора на протяжении всего матча.
- Каждый игрок напишет “!roll” в чат.
- Игрок с **большим роллом банит вторым и выбирает первым**. Игрок с **меньшим роллом банит первым и выбирает вторым**.
- Каждому игроку предоставляется 2 минуты на выбор бана. Если по окончанию времени выбор не сделан, бан будет выбран случайно.
- Выбор карт из маппула будет чередоваться между игроками.
- Игроки могут свободно выбирать из любой части маппула (кроме Tiebreaker).
- У игроков будет 2 минуты на выбор карты и 2 минуты на подготовку. Если по окончанию времени выбор не сделан, он будет сделан случайно. И если игроки не будут готовы по окончанию времени, матч будет начат в любом случае.
- Если игрок потеряет соединение между картами, то матч может быть задержан максимум на 10 минут. Эта задержка может быть применена только один раз.
- Если игрок потеряет соединение спустя 30 секунд после начала карты, то будет считаться, что они не прошли её.
- При потери соединения в первые 30 секунд карты, она может быть переиграна. Это разрешено один раз каждому игроку.
- Очки игроков, не прошедших карту, будут засчитываться.
- Карта, закончившаяся ничьей, не будет засчитана и будет сыграна заново. Если она закончиться ничьей ещё раз, то карта вновь не будет засчитана, и игрок, выбравший её, должен будет выбрать другую.
- В случае ничьи по очкам матча (пример: 4-4 в BO9), будет сыгран Tiebreaker.
  `,
};
