export default {
  name: "精英级全球太鼓锦标赛",
  description:
    "精英级全球太鼓锦标赛，尽管没有排名限制，是针对高排名玩家的1对1比赛。入围赛后的前128名会在双重淘汰赛中对决。",
  discord: "https://discord.gg/3mGC3HB",
  homepage: [
    {
      title: "参赛条件",
      body: `本赛没有排名限制或国籍限制。任何在过去12个月没被禁止的选手都能参加本次比赛。osu! 支援团队将有权利在审查阶段后禁止任何选手参赛。`,
    },
    {
      title: "赛程",
      body: `
### 比赛注册阶段
9月4日至9月19日。
### 审查阶段
9月4日至9月26日。
### 入围赛
10月2日至10月3日。
### 128强赛
10月9日至10月10日。
### 64强赛 + 败者组第 1 、 2 轮
10月16日至10月17日。
### 32强赛 + 败者组第 3 、 4 轮
10月23日至10月24日。
### 16强赛 + 败者组第 5 、 6 轮
10月30日至10月31日。
### 8强赛 + 败者组第 7 、 8 轮
11月6日至11月7日。
### 半决赛 + 败者组第 9、 10 轮
11月13日至11月14日。
### 胜者组决赛 + 败者组决赛
11月20日至11月21日。
### 败者组总决赛 + 总决赛
11月27日至11月28日。`,
    },
    {
      title: "比赛注册",
      body:
        "请用osu!账号登录，然后点击Register按钮注册。最后，请点击Discord按钮参加本赛的服务器. **你必须加入此服务器，否则我们将有权利把你从比赛中移除。**",
    },
    {
      title: "比赛奖品",
      body: `
- **1st place:** osu!个人主页徽章 
- **2nd place:** osu!个人主页徽章 （待确认）
- **3rd place:** osu!个人主页徽章 （待确认）`,
    },
  ],
  rules: `
# 基本规则
- 这个比赛是一个 **1对1双淘汰制的比赛。** 
- 选手们将会经过**双重淘汰赛**。
- 我们将使用Score V2作为得分系统。
- 任何符合规定的要求的玩家都能注册参加比赛。由于本赛可能会派给发胜利者徽章，有些选手可能会被osu!官方禁止参赛。
- 除了**主办者、图池管理员、总图池管理员和裁判**以外，所有职员都能参加本赛。
- 选手和职员必须彻底阅读规则。（我们将假设您在比赛整个过程中已经彻底了解这些规则）
- 所有选手必须尊重其他选手和职员，否则您可能会被禁赛或被加入黑名单。这条规则也关乎到所有职员。
- 任何规则改变或者意外事件会在Discord的服务器宣布。

# 阶段规则
- 本赛将会有9个阶段： 入围赛、 128强、 64强、 32强、 16强、 8强、 半决赛、 决赛以及总决赛。
- 我们将根据入围赛所有谱面的平均排名来进行选手排名。
- 每个阶段的胜利条件是：
    - 128强、 64强、 32强以及16强: 9局5胜
    - 8强: 11局6胜
    - 半决赛、 决赛以及总决赛: 13局7胜
   
# 入围赛规则
 - 在这轮比赛中，不同时段将会开放数个房间。
 - 裁判将会创建一个私人房间，并在特定的时间时被邀请进入房间中。请确保你准时上线。
 - 本轮将不会有热身图。
 - 我们将使用每名选手所有谱面的平均排名来进行选手的最终排名。
 - 每张谱面将按顺序打两次。分数较高的那轮将会用来进行排名。
 - 排名最高的128名选手将会进入双淘汰赛。

# 图池指示
- 比赛中的每个阶段将有一个图池: 入围赛、 128强、 64强、 32强、 16强、 8强、 半决赛、 决赛以及总决赛。
- 在同一个周末，败者组和胜者组将会使用同一个图池。
- 入围赛的图池将会与其他阶段不同，为 3 张 NoMod、2 张 Hidden、 2 张 HardRock、 2 张 DoubleTime 以及 1 张 Hidden + HardRock 图。
- 每个图吃将会有6个类别：**NoMod、 Hidden、 HardRock、DoubleTime、 FreeMod 和 Tiebreaker**.
- 128强与64强将各有14张谱面，32强至8强将各有15张铺面，半决赛至总决赛将各有19张谱面。
- NoMod图池在128强与64强时有4张图，32强至8强时有5张图、半决赛至总决赛将会有6张图。
- Hidden、 Hard Rock 和 Double Time图池在128强至8强时各有2张图, 半决赛至总决赛将会各有3张图。
- FreeMod图池在所有阶段中都会有3张图。
- FreeMod图池将会在FreeMod情况下打，每位选手必须使用 Hidden, HardRock 或两者都使用。
- Tiebreaker将会在FreeMod情况下打，但选手们不必使用Mod。
- 每个阶段的图池将会在前一个星期在Twitch频道上直播。

# 赛程安排
- 每个阶段将在**周末**进行。 (不过，如果双方在周末找不到适当的时间进行比赛，比赛能改到其他日子进行，前提是必须有裁判在哪个时间有空。)
- 我们会尽量根据选手的时区来进行时间安排。赛程将在每个阶段的前一个周末公开。
- 只有在两者都同意的情况下才能改期。您们将必须在该星期的**星期四，23:59 UTC**之前通知主办者，申请改期。

# 比赛规则
- 裁判会在比赛开始的10分钟前创建一个私人房间。到了比赛时间时，裁判将会邀请两位选手进入房间。 
- 如果没有裁判员或职员在场，比赛会被延期举行。
- 如果其中一名选手迟到，比赛最多可以延迟十分钟。
- 选手即使不能准时进入房间，只要在预定时间后的十分钟内到达，将不会被惩罚。
- 如果两名选手都不准时进入房间, 种子排名较高的选手将会晋级。
- 比赛将会使用 Head to Head 和 ScoreV2。比赛房间名为 "EGTS 2021: (红选手) vs (蓝选手)".
- 每名选手可以选择一张谱面（不超过3分钟）作为热身，而且必须在比赛开始前一小时将热身谱面发送给裁判或直播员。
- 选手若不跟从以上指定的时间限制，裁判会跳过他们的热身图。
- 每名选手必须禁用图池里（除了Tiebreaker）的**一张图**， 这张谱面在该场比赛之内不能被选择。
- 每名选手必须在房间聊天室输入 "!roll" 指令来掷骰子。
- **较高点数**的选手**先选后禁**，而**较低点数**的选手**先禁后选**。
- 选手们将会有2分钟选择他们想要禁用的谱面。如果他们在指定时间内未能做出选择，禁用的谱面将会随机掷点决定。
- 两名选手从图吃中交替选则图池里的谱面。
- 选手们能自由挑选任何种类的谱面。
- 选手们会有2分钟的时间选择谱面，以及2分钟准备好。 如果他们未能在指定时间内选择一张谱面，裁判将会掷点随机决定。选手若在指定准备时间结束后没准备好, 比赛无论如何将立即开始。
- 如果有选手在谱面选择时网络断线，必死最多只能够延迟10分钟。（这时间延迟只能使用一次.）
- 如果有选手在谱面开始的30秒后断线, 他们的分数会被当作输掉那一张谱面一样对待。
- 如果有选手在谱面开始的30秒之内断线，裁判员将允许两名选手重新开始那张谱面。每名选手只允许这么做一次。
- 谱面失败的选手的分数仍为有效，计入总分。
- 如果两名选手在一张谱面中得分相同，该局得分作废，而且重打此谱面。如果再次得分相同，该局仍然作废，然后选了这张图的选手将必须选择另外一张图。
- 如果比分相同 (例如9局5胜中，比分为4比4)，将会使用 Tiebreaker 谱面来决定获胜者。
  `,
};
