export default {
  name: "精英级全球太鼓锦标赛",
  description:
    "精英级全球太鼓锦标赛，是没有排名限制，针对顶级玩家的1对1比赛。资格赛成绩最好的64名选手将晋级至双败淘汰赛。",
  links: [
    {
      label: "Discord",
      link: "https://discord.gg/3mGC3HB"
    },
    {
      label: "Challonge",
      link: "https://challonge.com/EGTS2025"
    },
    {
      label: "Pick'ems",
      link: "https://pickem.hwc.hr/tournaments/94"
    },
    {
      label: "Twitch",
      link: "https://twitch.tv/gtsosu"
    },
  ],
  homepage: [
    {
      title: "参赛条件",
      body: `这个比赛没有排名或国籍限制。任何在最近12个月没有被限制的选手都能参加本次比赛。osu!官方有权利在审查阶段禁止任何选手参赛。`,
    },
    {
      title: "赛程",
      body: `
### 比赛注册阶段
1月5日至1月19日。
### 审查阶段
1月19日至2月2日。
### 资格赛
2月8日至2月9日。
### 六十四强赛
2月15日至2月16日。
### 三十二强赛及败者组第一轮
2月22日至2月23日。
### 十六强赛及败者组第二轮、第三轮
3月1日至3月2日。
### 八强赛及败者组第四轮、第五轮
3月8日至3月9日。
### 半决赛及及败者组第六轮、第七轮
3月15日至3月16日。
### 胜者组决赛及及败者组第八轮、第九轮
3月22日至3月23日。
### 败者组决赛及总决赛
3月29日至3月30日。`,
    },
    {
      title: "比赛注册",
      body:
        "首先使用osu!账号授权登录，然后点击上方的Register按钮注册，然后点击Discord按钮加入这个比赛的Discord服务器。**您必须加入Discord服务器，否则我们会将您移出比赛。**",
    },
    {
      title: "比赛奖品",
      body: `
- **冠军：** osu!个人主页徽章 
- **亚军：** osu!个人主页徽章 （待确认）
- **季军：** osu!个人主页徽章 （待确认）`,
    },
  ],
  rules: `
# 基本规则
- 这个比赛是一个**一对一的双败淘汰赛**。
- 我们将使用**Score V2**作为得分系统。
- 如果您的排名符合规定的要求，您就可以参加比赛。由于我们这次比赛可能会派发胜利者徽章，在审查阶段有些选手可能会被osu!官方禁止参赛。
- 主办成员中只有**解说员和/或直播员**允许参加比赛。
- 选手和主办成员必须彻底阅读规则。（我们会假定您在比赛整个过程中已经彻底了解这些规则）
- 每名选手必须尊重所有其他选手和主办成员，以及保持适当的态度。如果您不遵守这条规则，您有可能会被禁赛或加入黑名单。这条规则也适用于所有的主办成员。
- 任何规则改变或者意外事件会在Discord的服务器公布。

# 阶段规则
- 这次比赛共有8个阶段：资格赛、六十四强赛、三十二强赛、十六强赛、八强赛、半决赛、胜者组决赛和总决赛。
- 在资格赛中，我们将根据每名选手所有谱面的平均排名来对选手进行排名。
- 每个阶段的胜利条件是：
    - 六十四强赛： 9局5胜。
    - 三十二强赛、十六强赛、八强赛及败者组第1轮到第5轮：11局6胜。
    - 半决赛、胜者组决赛、总决赛及败者组第6轮到决赛：13局7胜。
    - *注意：在总决赛，胜者组一方需要赢一场，即赢一个13局7胜以获得胜利。败者组一方则需要赢两场。*
   
# 资格赛规则
 - 在这轮比赛中，会在周末的不同时间段创建多个房间。
 - 选手们可以登入我们的网站并在Schedule标签页中选择一个房间来决定比赛时间。
 - 裁判会创建一个私有房间，然后选手会在预定的时间被邀请到房间中。请确保您准时在线上。
 - 本轮没有热身。
 - 每个谱面按顺序打两轮。分数较高的那次成绩将被用作排名。
 - 我们将根据每名选手所有谱面的平均排名来对选手进行排名。
 - 排名最高的64名选手将会进入双败淘汰赛。

# 图池介绍
- 比赛中的每个阶段将有一个图池：资格赛、六十四强赛、三十二强赛、十六强赛、八强赛、半决赛、胜者组决赛和总决赛。
- 比赛中的所有曲子会取得作者的许可，或者是[osu! Featured Artists listing](https://osu.ppy.sh/beatmaps/artists)中的一部分。
- 在同一个周末比赛的胜者组和败者组将使用同一个图池。
- 每个图池有6个类别：**NoMod、Hidden、HardRock、DoubleTime、ForceMod和Tiebreaker**。资格赛图池没有Tiebreaker谱面。
- 资格赛的图池有10张铺面。六十四强赛的图池有14张谱面。 三十二强赛至八强赛的图池有15张谱面。半决赛至总决赛的图池有16张谱面。
- 在资格赛阶段，NoMod有3张谱面；在六十四强赛阶段，NoMod有4张谱面；在三十二强赛至八强赛阶段，有5张谱面；在半决赛至总决赛阶段，有6张谱面。
- 在所有阶段，Hidden、HardRock和DoubleTime有2张谱面。
- 在资格赛阶段，ForceMod有1张谱面。在其他阶段，ForceMod有3张谱面。
- ForceMod谱面可以任意选择Mod。选手们必须使用Hidden或HardRock或两者进行比赛。
- Tiebreaker谱面会使用ForceMod规则来比赛，但是选手可以不必使用Mod。
- 每个阶段的图池会在前一个星期公布。

# 赛程安排
- 每个阶段会在**周末**进行比赛。（但是，如果双方不能在周末找到合适的时间比赛，比赛可改在其他日期举行，但需要有裁判在那个时间有空。）
- 我们将根据时区尽量把比赛安排在最佳时间进行。赛程时间表将在每个阶段的前一个周末公布。
- 只有在双方都同意的情况下才能改期。双方必须在那个星期的**国际标准时间星期四的23:59**之前决定新的比赛时间，并且附加证据通知主办。

# 比赛规则
- 裁判员会在比赛开始的十分钟之前建立新房间。到了比赛时间，裁判员将邀请两位选手进入房间。
- 如果没有裁判员或者主办成员执法比赛，比赛会被延期举行。
- 如果有玩家迟到，比赛可以延迟最多十分钟。
- 如果有选手不能准时进入房间，只要在预定时间后的十分钟内赶到，将不会受到惩罚。
- 如果两位选手都没有准时进入房间，资格赛中排名较高的选手将会晋级。
- 比赛会使用Head to Head和ScoreV2。 比赛房间的名称是 : "EGTS 2025: (红方) vs (蓝方)"。
- 比赛没有热身。
- 每位选手需要在房间聊天室中使用“!roll”指令来掷骰子。
- 获得较高点数的选手**先选后禁**。获得较低点数的选手**先禁后选**。
- 每位选手必须禁用**一张谱面**(除了Tiebreaker），这张谱面在该场比赛之内不能被选择。
- 每位选手有两分钟时间选择要禁用的谱面。如果未能在两分钟内选出，裁判员将会掷点随机选择禁用的谱面。
- 在禁用阶段后，两位选手交替从图池中选择谱面，直到一位选手胜出。
- 每位选手能自由挑选任何种类的谱面。
- 每位选手有两分钟时间选择谱面，以及两分钟准备比赛。如果选手未能在两分钟内选择一张谱面，裁判员将会掷点随机选择谱面。如果选手未能在2分钟内准备，无论何种原因，比赛将会立即开始。
- 如果有选手在谱面选择的时候网络断线，比赛可以延迟最多10分钟。每位选手只允许延迟一次。
- 如果有选手在谱面开始的30秒之后断线，他们会被视作输掉这一局比赛。
- 如果断线发生在谱面开始的30秒之内，可以申请重赛。每位选手只允许申请重赛一次。
- 所有谱面强制使用No Fail进行比赛。如果有选手在ForceMod或TieBreaker谱面中忘记使用No Fail，失败选手的得分会被视为有效。
- 如果两位选手在一局比赛中得分相同，该局比赛将会重赛。如果再次打平，该谱面将被禁用。选择这张谱面的选手可以重新选择一张谱面。
- 如果比分相同（比如在9局5胜中，比分为4比4），将会使用Tiebreaker谱面决定胜者。
- 未尽事宜，另行通知。
 `,
};
