export default {
    name: "Intermediate Global Taiko Showdown",
    description:
      "Intermediate Global Taiko Showdown, основополагающий турнир этой серии. Он проходит в формате 2v2 для игроков среднего уровня, и открыт для рангов от #3500 до #10000.",
    discord: "https://discord.gg/a6PzzFz",
    homepage: [
      {
        title: "Ограничения",
        body: `1. Во время регистрации ваш рейтинг в мире должен быть в диапазоне #3500-#10000 во время регистрации. Это значит, что вы должны оставаться в этом диапазоне до конца регистрации. 
  2. Во время прохождения турнира ваш рейтинг не должен превысить #2500. В случае превышения данного лимита вы будете дисквалифицированы. 
  3. Вы должны зайти на Discord сервер турнира.
  4. Любой игрок osu!taiko, который не был забанен за последние 12 месяцев, может принять участие в турнире. osu! стафф имеют право отстранить любого игрока от турнира после скрининга.`,
      },
      { 
        title: "Регистрация", 
        body: `**Пожалуйста, нажмите на кнопку регистрации выше, после того как вы вошли под своим osu! аккаунтом, а затем нажмите на кнопку Discord, чтобы войти на сервер турнира.**
  
  **Быть на Discord сервере обязательно для участия в турнире, иначе вы будете исключены из него.**`,
      }, 
      {
        title: "Даты",
        body: `
  ### Период регистрации
  2 мая 23:59 UTC - 23 мая 23:59 UTC 
  ### Скрининг и формирование команд
  23 мая - 30 мая 
  ### Квалификация
  6 июня - 7 июня 
  ### Групповая стадия
  13 июня - 14 июня 
  ### 1/8 финала
  20 июня - 21 июня 
  ### Четвертьфинал и Сетка лузеров Раунды 1 и 2
  27 июня - 28 июня 
  ### Полуфинал и Сетка лузеров Раунды 3 и 4
  4 июля - 5 июля 
  ### Финал, и в Сетке лузеров Финал и Гранд Финал
  11 июля - 12 июля 
  ### All-Star и Гранд Финал
  18 июля - 19 июля `,
      },
      {
        title: "Призы",
        body: `
   - **1-е место:** значок на профиль (ещё не подтверждено), $64 или 6 месяцев osu!supporter на игрока и командный баннер за первое место 
   - **2-е место:** $48 или 4 месяца osu!supporter на игрока и командный баннер за второе место 
   - **3-е место:** $32 или 2 месяца osu!supporter на игрока и командный баннер за третье место `,
      },
    ],
    rules: `
# Основные правила
 - Турнир проводится в формате **2v2 с командами из максимум 5 игроков**.
 - Команды сначала проходят квалификацию. Затем они будут играть в **Групповой стадии** и наконец в **Сетке c выбыванием после двух поражений**.
 - Очки считаются по системе **Score V2**.
 - Любой игрок, удовлетворяющий лимиту на рейтинг, может зарегистрироваться на турнир. Поскольку этот турнир будет иметь свой значок, некоторые игроки могут оказаться недопущенными к участию по решению osu! стафф.
 - Игроки, помогающие в организации турнира, также могут принять участие, за исключением **Организаторов, Маппулеров и Рефери**.
 - Игроки и помощники огранизаторов должны целиком прочитать данные правила (и на всём протяжении турнира мы будем подразумевать, что вы их прочитали).
 - Все участники должны быть доброжелательными и относится с уважением друг к другу. Не соблюдение данного правила может привести к бану/занесению в чёрный список турнира. Данное правило касается и помощников организаторов.
 - Все изменения в правилах и неожиданные ситуации будут объявлены в Discord сервере.
  
# Регистрация на турнир и формирование команд
 - Чтобы принять участие вы должны удовлетворять ограничениям, указанным в **“Ограничения по рейтингу”**.
 - Игроки регистрируются индивидуально. Когда их регистрация будет подтверждена, им выдадут роль страны.
 - Организаторы могут не допустить к участию игрока, если они решат, что уровень способностей игрока не соответствует турниру.
 - В этом году мы допускаем участие двух команд от одной страны при определённых условиях:
     - От страны зарегистрировалось **7 или более игроков**.
     - Каждая команда должна иметь **хотя бы 3 игрока**.
   - Из-за предыдущего правила могут возникнуть разные ситуации при создании команд:
     - Если от страны зарегистрировалось 5 или меньше игроков, то они сформируют одну команду, выступающую за их страну.
     -  В случае, что от страны зарегистрировалось более 10 игроков, игроки решат между собой, кто примет участие в турнире. Если они не смогут прийти к решению, топ 10 по рейтингу будут выбраны для формирования двух команд.
     -  В случае 6 игроков, им придётся выбрать 5 игроков, которые примут участие в турнире. Если они не смогут прийти к решению, команда будет сформирована из топа 5 по рейтингу.
     -  В случае от 7 до 10 игроков (после отбора по рейтингу), то у игроков будет несколько дней на принятие решения, как разделиться по командам.
     Желательно как можно скорее прийти к решению, чтобы далее выбрать капитана и работать с расписанием и подготовкой к матчам.
     -  Если игроки не смогут прийти к общему решению, то они будут распределены по pp и разделены на две команды хотя бы по 3 игрока с лучшими игроками в одной команде, и худшими в другой.
     -  Игроки выберут из своего состава капитана.
     - Если игроки не выберут капитана, им станет игрок с самым высоким рейтингом.
   - Капитан будет ответственен за перенос матчей в случае необходимости и будет обеспечивать присутствие своей команды на них.
  
# Правила стадий турнира
 -  Всего в турнире 7 стадий: Квалификация, Групповая Стадия, 1/8 финала, Четвертьфинал, Полуфинал, Финал и Гранд Финал.
 -  Все команды будут распределены на 4 уровня по среднему, взятому из их мест на каждой карте квалификации. Эти 4 уровня: Top seed, High seed, Low seed и Unseeded. (Процесс распределения описан более подробно в "Инструкция по квалификации")
 -  Команды будут разделены на **8 групп по 4 команды** во время жеребьевки, которая будет проведена в воскресенье, 7 июня.
 -  В Групповой стадии все команды каждой группы сразятся друг с другом. **2 лучшие команды** пройдут в следующую стадию.
 -  Результаты каждой группы для каждой команды будут определяться в следующем приоритете:
      - Наибольшее количество выигранных матчей.
      - Наибольшая разница между количеством выигранных и проигранных карт.
      - Наибольшее количество выигранных карт.
      - Победитель матча команд, между которыми ничья.
   - В Групповой стадии техническая победа равнозначна результату 1:0, т.е. в счёт выигранных карт пойдёт только одна.
   - Условия победы в каждой стадии турнира:
     - Групповая стадия: BO9 (выиграйте 5 карт).
     - 1/8 финала, Четвертьфинал и Сетка лузеров Раунды 1 и 2: BO11 (выиграйте 6 карт).
     - Полуфинал, Финал, Гранд Финал и Сетка лузеров Раунды 3 и 4: BO13 (выиграйте 7 карт).
  
# Правила квалификации
- Во время этого раунда будет доступно несколько лобби в разное время.
 - Будет создан приватное лобби и команды получат приглашение в него, когда настанет время матча. Обязательно будьте в сети в это время.
 - Карты разминки не будет.
 - По два человека от команды будут играть каждую карту. На замену игроков ограничений нет. 
 - Распределение команд будет произведено по среднему, взятому из их мест на каждой карте.
 - Все карты будут сыграны два раза. В зачёт пойдёт лучшая попытка.
 - 32 лучшие команды пройдут в групповую стадию.
  
# Правила проведения матчей
 - Рефери создаст приватное лобби за 10 минут до начала. Оба капитана команд получат приглашение, когда наступит время матча. Затем рефери или капитаны пригласят остальных игроков в комнату.
 - Если ни один рефери или организатор не будет присутствовать, то матч будет отложен.
 - Если не будет присутствовать достаточное количество игроков, то матч может быть задержан максимум на 10 минут.
 - Если ни одна из команд не наберёт минимальное необходимое количество игроков после 10 минут, то в Групповой стадии матч будет считаться поражением для обеих команд. В сетке команда с высшим уровнем пройдёт в следующую стадию.
 - Матч будет проводиться в режиме TeamVs и ScoreV2 и название комнаты должно быть: "IGTS 2020: (Красная команда) vs (Синяя команда)".
 - Каждая команда может выбрать одну карту разминку, но она должна быть короче 3-х минут. Любое количество игроков может играть в разминке.
 - Если команда больше 2-х минут выбирает разминку, рефери пропустит её.
 - Капитан каждой команды напишет “!roll” в чат.
 - Команда с **большим роллом банит второй и выбирает первой**. Команда с **меньшим роллом банит первой и выбирает второй**.
 - Каждый капитан должен забанить **одну карту** из маппула (кроме Tiebreaker). Эти карты будут недоступны для выбора на протяжении всего матча.
 - Каждому капитану предоставляется 2 минуты на выбор бана. Если по окончанию времени выбор не сделан, бан будет выбран случайно.
 - Выбор карт будет чередоваться между капитанами.
 - Капитаны могут свободно выбирать из любой части маппула.
 - У команд будет 2 минуты на выбор карты и 2 минуты на подготовку. Если по окончанию времени выбор не сделан, он будет сделан случайно.
 - Замена игроков посреди матча разрешена без ограничений.
 - Если игрок потеряет соединение между картами и команда не сможет найти замену, то матч может быть задержан максимум на 10 минут. Эта задержка может быть применена только один раз.
 - Если игрок потеряет соединение во время карты, то будет считаться, что они не прошли карту.
 - При потери соединения в первые 30 секунд карты, она может быть переиграна. Это разрешено один раз каждой команде.
 - Очки игроков, не прошедших карту, не добавляются к счёту команды.
 - Карта, закончившаяся ничьей, не будет засчитана и будет сыграна заново.
 - В случае ничьи по очкам матча (пример: 4-4 в BO9), будет сыгран Tiebreaker.
  
# Правила, касающиеся маппула
 - Для данных стадий турнира будет по 1-му маппулу: Квалификация, Групповая Стадия, 1/16 финала, Четвертьфинал, Полуфинал, Финал и Гранд Финал. Отдельный маппул будет подготовлен для All-star (информацию об этом можно найти в “Правила All-star”).
 - Сетка лузеров будет проходить на том же пуле, как и Сетка победителей той же недели.
 - Каждый маппул состоит из 6 частей: NoMod, Hidden, HardRock, DoubleTime, FreeMod и Tiebreaker.
 - Пул квалификаций будет состоять из 2 NoMod, 1 Hidden, 1 HardRock и 1 DoubleTime карт.
 - На всех остальных стадиях турнира будет по 2 Hidden, HardRock и DoubleTime карты и 3 FreeMod карты.
 - Маппул Групповой стадии будет состоять из 14 карт, маппулы 1/8 финала and Четвертьфинала - из 15 карт, маппулы Полуфинала, Финала и Гранд Финала - из 16 карт.
 - Пул FreeMod играется с активированным FreeMod. Каждый игрок может выбрать **Hidden, HardRock, или оба вместе**. **Хотя бы один игрок из каждой команды должен выбрать хотя бы один мод**.
 - Tiebreaker будет играться с FreeMod, но не обязательно иметь игрока с модом.
 - Маппул каждой стадии будет показан за неделю до матчей.
  
# Правила расписания матчей
 - Каждая стадия будет проводиться **по выходным**. Если во время выходных нет удобного времени для матча, разрешено провести его в другой день.
 - Матчи могут пересекаться, если есть свободные рефери.
 - Мы будем стараться выбирать лучшее время в соответствии с часовыми поясами команд. Расписание будет выложено за неделю до стадии.
 - Перенос матча будет рассмотрен, если обе команды согласятся с новым временем. Это должно произойти и быть сообщено организаторам до **Четверга в 23:59 UTC+0** той недели, на которой проводится матч.
 - Перенос матча может быть запрошен только **капитаном команды**.
  
# Правила All-star
 -  "All-Star" - весёлое мероприятие, которое будет проходить на тех же выходных, что и Гранд Финал!
На нём лучшие игроки турнира сразятся друг с другом в необычном матче.
 -  8 игроков будут принимать участие в мероприятии. Они будут определены голосованием.
 -  Топ 8 игроков будут участвовать в All-Star. Если в топ 8-ми по голосам окажется более двух игроков из одной страны, то только 2-е из них примут участие.
 -  2 игрока, получивших наибольшее количество голосов, станут капитанами каждой команды. Их сокомандники будут определены из результатов голосования. Первый игрок будет играть с игроками на нечётных местах, а второй игрок с игроками на чётных местах.
 -  Маппул будет составлен специальной командой маппулеров.
 -  Мероприятие будет матчем 4v4 со следующими правилами:
     -  BO15.
     -  Маппул будет состоять из 20 FreeMod карт и 1 TB. Все карты можно играть с любой комбинацией модов. Однако некоторые из них могут оказаться невозможными с модами!
     -  Банов не будет.
     -  Выбор карт как и в обычном матче.
     -  Правила по потерям соединения как и в обычном матче.
    `,
};