export default {
    name: "Intermediate Global Taiko Showdown",
    description:
      "Intermediate Global Taiko Showdown, このシリーズの創立大会. 中級者向けの2対2の国別大会で、ランク制限#4,500から#10,000。それぞれのチームは最初に予選でプレイします。 その後はグループステージにプレイし、最後にトーナメント（ダブルイリミネーション方式）でプレイします。",
    discord: "https://discord.gg/a6PzzFz",
    homepage: [
      {
        title: "参加条件",
        body: `1. 参加者は**登録期間終了時まで**，PPランキング上で4500～10000位を維持している必要があります。 
  2. 大会中に**4000位より**もランクを上げることは許可されていません。もし越えてしまった場合は、**失格扱いとします**。 
  3. 大会用Discordには必ず参加してください。
  4. osu!公式スタッフはスクリーニング検査後何らかの問題があった場合プレイヤーを大会から排除する権利を留保しています。`,
      },
      { 
        title: "登録方法", 
        body: `**osu!のアカウントでログインした後、上にあるRegisterボタンを押してください。その後Discordの大会サーバーに上のボタンを押して参加してください。**
  
  **大会に出場する場合Discordサーバーへの参加は必須です。もし参加しなかった場合は大会への出場が取り消しとなります。**`,
      }, 
      {
        title: "日程",
        body: `
  ### 登録期間
  2022年02月19日～03月06日午前9時 (日本時間) まで 
  ### スクリーニングとロスター決め
  03月06日～03月19日 
  ### 予選
  3月26日・27日
  ### グループステージ
  4月2日・3日 
  ### Round of 16
  4月9日・10日
  ### 準々決勝&敗者ブラケット第1と第2ラウンド
  4月16日・17日 
  ### 準決勝&敗者ブラケット第3と第4ラウンド
  4月23日・24日 
  ### 勝者ブラケット決勝&敗者ブラケット決勝とグランドファイナル
  4月30日・5月1日
  ### オールスター + グランドファイナル
  5月7日・5月8日 `,
      },
      {
        title: "賞品",
        body: `
   - **優勝：**osu! プロフィールバッジ（手続き中）、１位チームバナー 
   - **準優勝：**２位チームバナー 
   - **3位：**３位チームバナー `,
      },
    ],
    rules: `
# 基本ルール
  - この大会は**2対2のチーム戦**。チームのサイズは**最大５人**です。 
  - それぞれのチームは最初に**予選**でプレイします。 その後は**グループステージ**にプレイし、最後に**トーナメント（ダブルイリミネーション方式）**でプレイします。 
  - 試合は**Score V2**を使用して行います。 
  - ランク制限の部分に記載されている要件を満たしているすべてのプレイヤーが大会への参加を許可されます。 このトーナメントはプロフィールバッジを取得することを目的としているので、何人かのプレーヤーはosuのスタッフによって排除されるかもしれません。 
  - **主催、マップセレクターと審判以外**のスタッフは参加可能です。 
  - プレイヤーとスタッフはこのルールをしっかり読んでおく必要があります。（スタッフはトーナメント全体を通して、ルールを熟知しているものだと仮定します。） 
  - 大会の進行を阻害する行為または迷惑行為等を行った場合、ペナルティを与える可能性があります。 このルールはスタッフも例外ではありません。 
  - ルールに変更があった場合や、予期しない事態が起きた場合、フォーラムとDiscordサーバー内でアナウンスされます。 
  
# 大会登録とチームの組み方
  - **ランク制限**に書いてある基準を満たしてるプレイヤーのみ参加可能です。 
  - 大会期間中は、#4000以上のランクアップは認められません。この制限を超えた場合、失格となります。
  - プレイヤーはそれぞれ個人で登録します。承認されると、国の代表として各国のチームに加わります。 
  - osu!スタッフは、登録したプレイヤーのレベルと大会のレベルがあっていないという判断をした場合、ランク制限を満たしていても参加を断わることができます。 
  - スクリーニング後参加できるな国が35カ国以上ある場合は、1カ国につき1チームのみ参加可能です。その場合、1つの国に5人以上の選手が登録されていれば、その国の選手同士で大会に参加する選手を決定することになります。決まらない場合はランキング上位5名でチームを編成する。
  - 35カ国以下ある場合は以下の条件を満たした場合、1つの国に対して2つのチームを作ることを許可します： 
    - 同じ国のプレイヤーが**7人以上**参加した場合。 
    - それぞれのチームは**最低３人**。
  - 以前のルールのため、チームを作成する際には、異なる状況があります: 
    - プレイヤーが５人以下の登録だった場合、そのまま１つのチームを組みます。 
    - 同じ国に10名以上の選手が登録されている場合は、選手同士で参加者を決定します。決められなかった場合は、ランキング上位10名の選手を2チームに分けます。 
    - 6名の場合は、参加する5名の選手を決定する。決められなかった場合は、ランキング上位5名がチームを構成することになります。 
    - ある国の選手が7～10人（最高ランクの選手をキープした上で）登録している場合、その国の選手は2つのチームの間でどのように自分たちを分けるかを決めるために数日の猶予があります。 
    できるだけ早く合意に達してキャプテンを決め、試合のスケジュールや準備を迅速に行えるようにすることをお勧めします。  
    - 選手が合意に至らない場合は、PPで順位を決めて、2チームにそれぞれ3人以上のメンバーを入れて、1チームに最高順位、2チームに最低順位の選手を入れることになります。 
    - 選手はチームのキャプテンを決める。 
    - 選手が同意できなかった場合は、最高ランクの選手が選ばれます。
    - 試合のリスケジュールが必要な場合、リスケジュールするのはキャプテンであり、チームのプレイヤーが試合に参加できるよう責任を持ちます。 
  
# ラウンド説明
  - この大会はステージが７つあります：予選、グループステージ、RO16、準々決勝、準決勝、決勝とグランドファイナル。 
  - 予選は選手のの平均によってチームのシードが選ばれます。 
  - ３２チーム以上参加している場合、予選のベスト３２のみ大会を進められます。 
  - チームは**４チームのグループ８個**に分けられます。日曜日06月07日に結果が発表されます。 
  - グループステージでは各グループ各チーム一回ずつ向き合います。**トップ2**のチームが進みます。 
  - グループのランキングの決め方: 
     - 勝った回数 
     - 譜面の勝利 - 譜面の敗北) が一番高い 
     - 譜面の勝利の数が一番多い 
     - 同点のチームの試合の優勝者
  - グループステージでは相手のチームが来なかった場合,　試合は5:0, +1.0 スコアの勝利となります。
  - 試合に勝つ条件: 
    - グループステージ : BO9（5点勝利） 
    - RO16, 準々決勝, 準決勝, 準決勝 : BO11（6点勝利） 
    - 最終決戦: BO13（7点勝利）

# 予選説明
  - このラウンド中は、様々な時間帯にロビーが利用できます。 
  - プライベートマッチが作成され、時間になるとロビーに招待されます。ちゃんと時間にオンラインになっていることを気を付けてください。 
  - ウォームアップはありません。 
  - 1譜面につき、1チーム2名のみのプレイとなります。プレイヤーの入れ替えに制限はありません。 
  - シーディングは各譜面の平均順位で行います。 
  - 同点の場合は、全マップでのベストスコアの合計が高いチームが上位シードとなります。
  - 譜面は、ロビー開催中に2回連続でプレイします。ベストランはランキングにカウントされます。 
  - ベスト32のチームのみがグループステージに進みます。 
  
# 試合説明
  - 試合時間の十分前に審判がロビーを開けます。試合時間になったらキャプテンがロビーに招待されます。他のプレイヤーは審判かキャプテンに招待されてれロビーに入ります。  
  - 審判がいない場合試合は延期されます。 
  - 選手が足りない場合、試合は最大10分延期されます。 
  - 延期時間内であれば、試合時間後に即入室しなかった場合のペナルティはありません。 
  - 両チーム選手が足りない場合、グループステージではも敗北となります。他のラウンドではシードが高い方のチームが進みます。 
  - 試合は TeamVs と ScoreV2 のロビーで行います。 ロビーの名前は : "IGTS 2022: (赤チーム) vs (青チーム)"。 
  - ウォームアップはチーム一曲ずつ（三分以下）行います。ウォームアップ中は全プレイヤーがロビーに入ってても構いません。 
  - 2分以内にウォームアップを決められなかった場合、そのチームのウォームアップはスキップさする。 
  - 各チームのキャプテンが**１譜面**ずつバンします。(Tiebreaker以外の譜面) バンされた譜面はこの試合中選択不可能です。 
  - 各チームのキャプテンが "!roll"コマンドを使ってロールします。 
  - **ロールで勝った方のチームがバンが二番目でピックが一番目**となります. **負けた方のチームはバンが一番目でピックが二番目**となります。  
  - キャプテンにはバンを選ぶ為に2分与えられます。その時間までにレフリーに伝えなかった場合は、ロールでバンが決められます。 
  - 譜面のピックは交代します。 
  - キャプテンは制限なしでどのブラケットからでも譜面を選べます。 
  - チームには譜面を選ぶ為に二分与えられます。そして準備をする為に2分あります。タイマー終了までにピックを伝えなかったチームは、ロールで譜面が選ばれます。 
  - 選手の入れ替わりは制限なしです。 
  - 各譜面開始前にプレイヤーの回線が切断し交代できるプレイヤーがいない場合試合は最大10分延期可能です。 
  - 譜面のプレイ中にプレイヤーの回線が切断した場合、クリア失敗として扱われます。 
  - 譜面の最初の30秒以内に回線が切断した場合、譜面をやり直すことが可能です。ただし各チーム最大一回までしか許されません。 
  - クリア失敗したプレイヤーのスコアはチームのスコアに加算されません。 
  - 譜面のスコアが同点で終わった場合、この点は無効になり譜面を再度プレイします。 
  - 点数同点の場合（例: 5点勝利の試合で4-4）Tiebreakerが選ばれます。 
    
# Mappool説明
  - オールスター、予選、グループステージ, RO16, 準々決勝, 準決勝, 準決勝とグランドファイナルにはそれぞれ一つのMappoolが用意されます。 
  - 予選は他ラウンドと違いNomod２つ、Hidden１つ、Hard Rock１つ、Double Time１つとFree Mod１つのMappoolを使います。 
  - ルーザーズ・ブラケットはウィナーズがその週に使うMappoolと同じものを使います。 
  - それぞれのMappoolはNoMod, Hidden, HardRock, DoubleTime, FreeModとTiebreakerの６つのブラケットに分けられます。 
  - Group Stageは１４譜面、RO16、Quarterfinals、SemifinalsとFinalsは１５譜面、Grand Finalsは１６譜面とそれぞれMappoolの譜面の数が決まってます。 
  - Hidden, HardRock と DoubleTime のブラケットは二譜面、 FreeModブラケットは三譜面。 
  - FreeModはFreeModがオンになった状態でプレイします。プレイヤーはそれぞれ **HiddenかHardRock 、もしくは両方同時に選べます**。**それぞれのチームはプレイヤー最低一人が最低一つModを付ける必要があります**。  
  - TiebreakerはFreeModオンでプレイされますがプレイヤー最低一人が最低一つModを付ける必要はありません。 
  - それぞれのステージのMappoolは一週間前にショーケースされます。 
  
# スケジュール説明
  - 試合は週末に開催されます。（ただし他プレイヤーと時間が合わない場合は週末以外に再スケジュールできます） 
  - 審判が足りていれば試合は複数同時刻に開催できます。 
  - スタッフは出来るだけ全プレイヤーが納得できる時間にスケジュールを合わせるよう心がけます。スケジュールは試合の一週間前の週末に公開されます。 
  - 再スケジュールは両チームが時間に賛成する必要があります。これは試合が開催される週の**木曜日UTC+0 23:59**までにスタッフに通知する必要があります 
  - 再スケジュールはチームキャプテンのみ要請出来ます。 
  
# オールスター説明
  - オールスターはグランドファイナルと同じ週末に開催される楽しいイベントです! 
  大会の最強の選手がスペシャルマッチで対戦するイベントです。 
  - 8名の選手が参加します。投票で決定します。 
  - オールスターには投票結果上位8名の選手が出場します。上位8人の中に2人以上同じ国の選手がいる場合は、ベスト2の選手のみがオールスターに出場します。 
  - 上位2名が各チームのキャプテンとなる。チームメイトは、次の6名の選手の順位によって決定します。投票数1位の選手は奇数の選手、2位の選手は偶数の選手とチームを組みます。  
  - グランドファイナルのマッププールを使用します。 
  - イベントでは以下のルールで4vs4の試合を行います: 
    - BO15（8点勝利）。 
    - 全ての譜面にNM, HD, HRを使ってどのようなモッドの組み合わせができます。
    - バン無し。 
    - 譜面選択は普通の試合と同じです。 
    - 切断の場合普通の試合と同じルールです。
   `,
};
