export default {
    name: "Intermediate Global Taiko Showdown",
    description:
      "Intermediate Global Taiko Showdown는, GTS시리즈의 시작과 함께한 대회입니다. 중급 수준의 플레이어들을 위한 2대2 토너먼트로, 참가자는 #3,500위 부터 #10,000위 까지의 유저들로 제한되어 있습니다.",
    links: [
      {
        label: "디스코드",
        link: "https://discord.gg/a6PzzFz"
      },
      {
        label: "Challonge",
        link: "https://challonge.com/IGTS2020"
      },
      {
        label: "Pick'ems",
        link: "https://pickem.hwc.hr/tournaments/34"
      },
    ],
    homepage: [
      {
        title: "제한사항",
        body: `1. 참가 신청 기간 동안 순위가 3500등에서 10000등 사이여야 합니다. 참가 신청 기간이 끝날 때까지 순위가 해당 범위에서 벗어나면 안됩니다. 
  2. 대회 진행 중 참여자의 랭킹이 2500위보다 높아지면 참가 자격이 박탈됩니다.
  3. 대회의 디스코드 서버에 들어오셔야 합니다.
  4. 최근 12개월동안 밴(restricted)당한 적이 없는 모든 osu!taiko 유저들은 이 대회에 참가할 수 있습니다. 이외에 osu! 관리자 측에서 각 참가자가 이 대회에 참가하는 것이 불공정하다고 판단할 경우 참가자 검토 단계에서 해당 참가자의 참가 신청을 취소할 수 있습니다.`,
      },
      { 
        title: "참가신청", 
        body: `**osu! 계정으로 로그인한 후 상단의 Register 버튼을 눌러주세요. 그런 다음 Discord 버튼을 눌러 IGTS 2020 디스코드 서버에 들어와주세요.**
        
**대회에 참가하기 위해 IGTS 2020 디스코드 서버에 반드시 들어오셔야 합니다. 참가 신청 기간 내에 서버에 들어오지 않으면 대회 참가 신청이 취소됩니다.**`,
      }, 
      {
        title: "일정",
        body: `
  ### 참가 등록 기간
  5월 2일 23:59 UTC - 5월 23일 23:59 UTC 
  ### 참가 자격 검사 및 팀 결성
  5월 23일 - 5월 30일 
  ### 선발전
  6월 6일 - 6월 7일 
  ### 조별 예선전
  6월 13일 - 6월 14일 
  ### 16강전
  6월 20일 - 6월 21일 
  ### 8강전 및 패자조 1, 2차전
  6월 27일 - 6월 28일 
  ### (승자조) 준결승전 및 패자조 3, 4차전
  7월 4일 - 7월 5일 
  ### (승자조) 결승전, 패자조 준결승전(3·4위전) 및 패자조 결승전(2·3위전)
  7월 11일 - 7월 12일 
  ### 올스타전 및 최종 결승전
  7월 18일 - 7월 19일 `,
      },
      {
        title: "상품",
        body: `
   - **1등:** 프로필 배지 (미확정), 미화 64불 혹은 플레이어 별 6달 분의 서포터 및 1등 팀 배너 
   - **2등:** 미화 48불 혹은 플레이어 별 4달 분의 서포터 및 2등 팀 배너 
   - **3등:** 미화 32불 혹은 플레이어 별 2달 분의 서포터 및 3등 팀 배너 `,
      },
    ],
    rules: `
  # 전체 규칙
   - 이 대회는 **최대 5명이 한 팀을 이루어** **2대2 팀 대항 토너먼트**로 진행됩니다.
   - 각 팀들은 먼저 선발전을 치릅니다. 이후 **조별 예선전**을 치르고 이후 최종적으로 **더블-엘리미네이션(double elimination bracket)**방식으로 플레이합니다.
   - 점수 체계는 **Score V2**를 사용합니다.
   - 순위 제한 조건에 명시된 내용을 만족하는 플레이어는 누구나 신청할 수 있습니다. 본 대회는 배지 획득을 기획하고 있으므로 일부 플레이어는 osu! 운영진에 의해 참가가 거부될 수 있습니다.
   - **총괄자, 맵풀 선별자 및 심판**를 제외한 대회의 운영진들은 대회에 참여할 수 있습니다.
   - 플레이어와 운영진 구성원들은 본 규칙들을 전부 읽어야 합니다. (본 대회 측은 대회가 진행되는 동안 참여자가 규칙을 숙지하고 있다고 가정합니다.)
   - 모든 참여자는 상대를 존중하고 올바른 태도를 가져야 합니다. 따로 명시되지 않은 사항으로도 본 대회에서 추방당하거나 및 블랙리스트에 오를 수 있습니다. 이 규칙은 운영진 전원에게도 해당됩니다.
   - 규칙의 변경이나 뜻밖의 상황 발생 시에는 디스코드 서버에 공지됩니다.
  
# 대회 참가 및 팀 결성
   - 참여를 하기 위해서는 **순위 제한 조건**에 명시되어 있는 기준에 만족해야 합니다.
   - 플레이어는 개별적으로 신청합니다. 신청이 수리되면 국가 역할을 받습니다.
   - 대회의 운영진은 참가자의 실력이 순위 범위에 해당하는 실력보다 훨씬 뛰어나다고 여겨지면 참가 신청을 거절할 수 있습니다. 
   - 올해에는 다음의 조건을 만족하는 경우에 한해 국가 별 2개의 팀을 허용합니다:
     - 한 국가에서**7명 이상**의 플레이어가 신청
     - 각 팀은 **최소 3명** 이상으로 구성
   - 위 규칙으로 인해 팀을 구성하는 동안 다음과 같은 경우가 발생할 수 있습니다:
     - 한 국가에서 5명 이하의 플레이어가 등록한 경우, 해당 플레이어들은 자신들의 국가를 대표하는 팀을 구성하게 됩니다.
     - 한 국가에서 10명보다 많은 플레이어가 등록한 경우, 누가 참여할지 플레이어들끼리 정합니다. 결정하지 못한 경우 순위 상위 10명이 선택되어 2개의 팀을 이루게 됩니다.
     - 6명인 경우, 참여할 5명을 골라야 합니다. 5명을 정할 수 없다면 순위 상위 5명이 선택되어 하나의 팀을 이루게 됩니다.
     - (순위 상위 플레이어들을 유지한 채) 한 국가에서 등록한 플레이어 수가 7명에서 10명 사이인 경우, 해당 플레이어들은 어떻게 두 개의 팀으로 나눌지 수 일의 시간이 주어집니다.
     합의를 최대한 빠르게 진행하고 주장을 정하여 일정을 조성하고 빠르게 경기를 준비할 것을 추천드립니다.
     - 플레이어들 사이의 합의가 도출되지 않은 경우 pp로 순위를 매긴 뒤 순위 상위 팀과 하위 팀으로 팀 별 인원 최소 3명 이상을 유지하며 구성됩니다.
     - 플레이어들은 팀의 주장을 뽑습니다. 
     - 플레이어들이 동의하지 않거나 주장을 찾을 수 없다면 최고 순위의 플레이어가 주장으로 선택됩니다.
   - 주장은 필요한 경우 경기 일정을 재조정하고 경기에 팀원들이 참가할 것을 확인합니다.
  
# 대회 진행 규정
   - 본 대회에는 선발전, 조별 예선전, 16강전, 8강전, 준결승전, 결승전 그리고 최종 결승전으로 총 7개의 스테이지가 있습니다.
   - 팀은 선발전에서 진행한 맵 결과의 평균 순위로 탑 시드(Top seed), 하이 시드(High seed), 로 시드(Low seed), 시드 없음(Unseeded) 중 하나의 시드(seed)를 부여받습니다. (시드의 과정은 선발전 안내 문단에 좀 더 정확하게 설명되어 있습니다.)
   - 6월 7일 일요일에 진행될 drawing show 에서 **조당 4개 팀 총 8개의 조**가 뽑힙니다.
   - 조별 예선전에서는 각 조 내 모든 팀이 다른 팀과 한 번씩 대전합니다. **상위 2개 팀**이 16강전에 진출합니다.
   - 각 조의 성적은 다음의 순서로 결정됩니다:
      - 최다 매치 우승
      - 최대 (이긴 비트맵 수 - 진 비트맵 수) 수치
      - 최대 이긴 비트맵 수
      - 동 순위 팀 사이의 매치 우승
   - 조별 예선전에서 '부전승'은 점수 비율 1.0로서 5:0으로 이긴 것으로 간주됩니다.
   - 각 스테이지 별 승리 조건은 다음과 같습니다:
      - 조별 예선전: 9판 5선승제.
      - 16강전, 8강전, 패자조 1, 2차전: 11판 6선승제.
      - 준결승전, 결승전, 최종 결승전 및 패자조 3, 4차전: 13판 7선승제.
  
# 선발전 규정
   - 본 스테이지에서는 다양한 시간대에 여러 멀티 플레이 방이 생길 것입니다.
   - 비밀 방이 생성되고 해당 시간대의 팀들이 초대됩니다. 이 시간에 온라인일 수 있도록 해주세요.
   - 별도의 웜업(warmup)은 없습니다.
   - 맵마다 팀 당 두 명의 플레이어만 플레이합니다. 플레이어의 교체에는 제한이 없습니다.  
   - 시드는 각 팀의 각 맵 별 평균 순위에 따라 부여됩니다. 
   - 한 방에서 2개의 맵을 연속으로 플레이합니다. 둘 중 더 좋은 플레이를 순위의 지표로 사용합니다.
   - 상위 32개의 팀이 조별 예선전에 진출합니다.
  
# 매치 규정
   - 매치 10분 전에 심판이 비밀 방을 생성합니다. 각 팀의 주장은 매치 시간에 방으로 초대됩니다. 이후 심판 혹은 주장이 다른 팀원을 초대합니다.
   - 해당 시간에 진행이 가능한 운영진 구성원 혹은 심판이 없을 경우 매치는 연기됩니다.
   - 참여한 인원수가 최소 필요 인원보다 적은 경우 매치는 최대 10분까지 지연됩니다.
   - 매치 시작 시간이 지나고 방에 바로 들어오지 않았더라도 허용된 시간 이내라면 별도의 불이익은 없습니다.
   - 10분이 지난 뒤에도 두 팀 모두 최소 필요 인원을 갖추지 않은 경우 조별 예선전에서 두 팀 모두 패배로 간주됩니다. 더블 엘리미네이션 방식에선 높은 시드를 받은 팀이 유리합니다.
   - 매치는 팀 대전(TeamVs)과 ScoreV2로 진행되며 방 제목은 "IGTS 2020: (레드 팀) vs (블루 팀)"의 형식이어야 합니다.
   - 각 팀은 1개의 웜업(warmup) 맵이 허용되나 3분 미만이어야 합니다. 웜업 동안에는 모두가 방에 있을 수 있습니다. 
   - 웜업 맵을 선택하는 데 2분 이상이 소요되면 심판이 웜업을 생략합니다.
   - 각 주장은 맵풀에서 **하나의 비트맵**을 제외(ban)합니다 (타이브레이커 제외). 제외된 비트맵은 매치 진행 내내 선택이 금지됩니다.
   - 각 팀의 주장은 채팅에서 "!roll" 명령어를 이용해 난수를 생성(roll)합니다.
   - 두 팀 중**난수가 더 큰 쪽이 밴을 나중에 하고 맵을 먼저 고릅니다**. **난수가 작은 쪽은 밴을 먼저 하고 맵을 나중에 고릅니다**.
   - 각 주장은 밴을 알리는 데 2분의 시간이 주어집니다. 해당 시간 내에 심판에게 알리지 않았을 경우 밴할 맵은 roll을 이용해 결정됩니다.
   - 비트맵은 맵풀 내에서 주장끼리 번갈아 선택합니다. 
   - 주장은 각 부문에서 맵을 자유롭게 고릅니다. 
   - 팀은 맵을 고르는 시간 2분과 준비하는 시간 2분을 가집니다. 타이머가 끝나기 전에 맵을 고르지 않으면 맵은 roll을 이용하여 선택됩니다.
   - 매치가 진행되는 동안 플레이어를 자유롭게 교체할 수 있습니다.
   - 비트맵 중간에 플레이어의 연결이 끊어졌고 팀에서 교체할 수 없는 경우 매치는 최대 10분까지 지연이 가능합니다. 이 지연은 1회만 적용됩니다.
   - 플레이어의 연결이 끊긴 경우 해당 맵을 클리어하지 못한 것으로 간주됩니다.
   - 비트맵이 시작된 지 30초 이내에 연결이 끊긴 경우 맵을 다시 플레이할 수 있습니다. 이 사항은 팀 별로 1회만 허용됩니다.
   - 클리어하지 못한 플레이어의 점수는 팀 점수에 가산되지 않습니다.
   - 비트맵이 동점으로 끝난 경우 해당 매치는 무효가 되고 해당 맵을 다시 플레이하게 됩니다.
   - 타이 동점이 발생한 경우 (예: 9판 5선승제에서 4대4) 타이브레이커가 선택됩니다.
  
# 맵풀 안내
   - 선발전, 조별 예선전, 16강전, 8강전, 준결승전, 결승전 그리고 최종 결승전은 각자 맵풀을 1개씩 가집니다. 올스타전은 별도의 맵풀이 준비되어 있습니다. (자세한 사항은 올스타전 규칙을 참고하세요.)
   - 선발전 맵풀은 다른 스테이지들과 다르게 "모드 없음(NoMod)" 2개, "히든(HD)" 1개, "하드 락(HR)" 1개, "더블 타임(DT)" 1개로 이루어진 맵풀을 사용합니다.  
   - 패자조 경기는 같은 주 승자조 경기와 같은 맵풀을 사용합니다.
   - 각 맵풀은 "모드 없음(NoMod)", "히든(HD)", "하드 락(HR)", "더블 타임(DT)", "프리 모드(FreeMod)" 그리고 "타이브레이커(Tiebreaker)" 총 6개의 부문으로 이루어져 있습니다.
   - 조별 예선전은 14개의 맵, 16강전 및 8강전은 15개의 맵 그리고 준결승전, 결승전, 최종 결승전의 맵풀은 16개의 맵으로 이루어집니다.
   - 모든 스테이지에서 히든, 하드 락, 더블 타임 부문은 각각 맵 2개씩, 그리고 프리 모드는 3개의 맵으로 구성됩니다.
   - 프리 모드 맵풀은 프리 모드 옵션이 켜진 상태로 진행됩니다. 각 플레이어는 모드로 **히든, 하드 락 아니면 둘 모두**를 걸 수 있습니다. **각 팀의 최소 한 명은 하나 이상의 모드를 걸어야 합니다.**
   - 타이브레이커는 프리 모드 옵션이 켜진 상태로 진행되나 최소 한 명이 하나 이상의 모드를 걸 필요가 없습니다.
   - 각 스테이지의 맵풀은 일주일 전에 공개됩니다.
  
# 일정 조정 안내
   - 각 스테이지는 **주말 동안** 진행됩니다. (그러나 주말에 시간이 나지 않을 경우 다른 날로 일정을 변경하는 것을 허용합니다.)
   - 심판이 가능한 선에서 각 매치의 시간대가 겹치는 것이 가능합니다.
   - 시간대에 맞도록 최선을 다해 일정을 짭니다. 일정은 각 스테이지의 이전 주말에 공지됩니다.
   - 일정 재조정은 두 팀 모두가 해당 시간에 동의할 때에 이뤄집니다. 동의에 대한 증명은 해당 매치가 진행되는 주의 **UTC+0 23:59 목요일** 이전에 대회 운영진에게 보내야 합니다.
   - 일정 재조정은 **팀의 주장**을 통해서만 요청하시기 바랍니다.
  
# 올스타전 규칙
   - 올스타전은 최종 결승전과 같은 주말에 진행되는 이벤트성 경기입니다!
  본 대회의 최고 플레이어들끼리 치고 붙는 특별한 경기를 보여줄 겁니다.
   - 8명의 플레이어가 본 이벤트에 참여합니다. 플레이어는 투표로 결정됩니다.
   - 투표 결과 상위 8명이 올스타전에 참여합니다. 상위 8명에 동일 국가의 플레이어가 2명보다 많으면 상위 2명만 참여합니다.
   - 투표 결과 상위 플레이어 2명이 각 팀의 주장이 됩니다. 팀원은 나머지 6명의 순위로 결정됩니다. 최고로 많이 득표한 플레이어가 홀수 등수의 플레이어들과 한 팀을 이루고 두 번째로 많이 득표한 플레이어가 짝수 등수의 플레이어들과 한 팀을 이룹니다.
   - 맵풀은 맵풀 결정자들 중 엄선된 사람들이 만듭니다. 
   - 이 이벤트는 아래의 규칙을 따라 4대4 매치로 진행됩니다:
     - 15판 8선승제로 진행됩니다.
     - 맵풀은 프리 모드 부문 맵 20개와 타이브레이커 부문 맵 1개로 구성됩니다. 모든 맵에 대해 자유롭게 모드를 걸 수 있습니다. 어떤 맵은 모드를 걸기가 불가능할 수도 있어요!
     - 밴은 불가합니다.
     - 맵의 선택은 일반 매치와 같습니다.
     - 연결이 끊어진 경우 일반 매치의 규칙을 따릅니다.
    `,
  };