export default {
    name: "全球中级太鼓锦标赛",
    description:
      "全球中级太鼓锦标赛，是本系列锦标赛的初创赛事。这是一个排名限制在4500到10000名，面向中级玩家的二对二锦标赛。所有队伍需要首先参加资格赛，然后参加小组赛、冒泡赛，最后进入双败淘汰赛。",
    discord: "https://discord.gg/a6PzzFz",
    links: [
      {
        label: "Discord",
        link: "https://discord.gg/a6PzzFz"
      },
      {
        label: "Challonge Week 1: Group Stage",
        link: "https://challonge.com/IGTS2023Week1"
      },
      {
        label: "Challonge Week 2: Runoff Bracket",
        link: "https://challonge.com/IGTS2023Week2"
      },
      {
        label: "Challonge Week 3-6: Main Bracket",
        link: "https://challonge.com/IGTS2023Main"
      },
    ],
    homepage: [
      {
        title: "注册限制",
        body: `1.在整个报名期间，您的osu!taiko排名必须在4500到10000名之间。
  2.您不允许在比赛期间将排名提升至4000名以上。如果您超出这一限制，您将会被移出比赛。 
  3.您必须在比赛期间加入Discord服务器。
  4.您没有获得过IGTS冠军，或是在两年内获得过IGTS前三名。
  5.您不能获得过更高排名限制的GTS赛事前三名（RGTS/AGTS）。
  6.任何在过去12个月内受到过限制的osu!taiko玩家将不被允许参加本赛事。osu!官方有权力在审查阶段禁止选手参赛。`,
      },
      { 
        title: "比赛注册", 
        body: `**首先使用osu!账号授权登入，然后点击上方的注册按钮，然后点击Discord按钮加入我们的锦标赛服务器。**
  
  **您必须加入Discord服务器，否则我们会将您移出比赛。**`,
      }, 
      {
        title: "赛程",
        body: `
  ### 比赛注册
  3月19日至4月2日23时59分。（国际标准时间，下同）
  ### 审查及队内筛选
  4月2日至4月9日。
  ### 资格赛
  4月15日至4月16日。
  ### 第一周/小组赛
  4月22日至4月23日。
  ### 第二周/冒泡赛
  4月29日至4月30日。
  ### 第三周/十六强赛，胜者组八强赛，败者组第一轮
  5月6日至5月7日。
  ### 第四周/胜者组半决赛，败者组第二轮、第三轮
  5月13日至5月14日。
  ### 第五周/胜者组决赛，败者组第四轮、第五轮
  5月20日至5月21日。
  ### 第五周/总决赛，败者组决赛，全明星赛
  5月27日至5月28日。`,
      },
      {
        title: "奖品",
        body: `
  - **第一名：** osu!个人主页徽章，冠军横幅
  - **第二名：** 亚军横幅。
  - **第三名：** 季军横幅。`,
      },
    ],
    rules: `
  # 基本规则
  - 本赛事是一个**二对二的团体比赛**，每支队伍**最多能有5名选手**。
  - 所有队伍需要首先参加**资格赛**，然后参加**小组赛**、**冒泡赛**，最后进入**双败淘汰赛**。
  - 我们将使用**Score V2**作为得分系统。
  - 如果您的排名符合规则的要求，您就可以参加比赛。由于本赛事会申请派发胜利者徽章，可能会有选手被osu!官方禁止参赛。
  - 除了**主办成员**（**组织者、图池管理员、图池测试员/回放员、自制谱师和裁判员**）之外，其他**辅助成员**（**解说员、推流员**等等）都可以参加比赛。
  - 被淘汰的选手可以以**裁判员或图池测试员/回放员**角色加入主办成员团队。不允许以其他角色加入团队。选手可以在任何时候加入**辅助成员**团队。
  - 选手和主办成员必须彻底阅读规则。（我们会假定您在比赛整个过程中已经彻底了解这些规则）
  - 每名选手必须尊重所有其他选手和主办成员，以及保持适当的态度。如果您不遵守这条规则，您有可能会被禁赛或加入黑名单。这条规则也适用于所有的主办成员。
  - 任何规则变更或者预期以外的事件会在Discord服务器中公布。
  - 任何有关本届赛事的举报请发送至官方锦标赛委员会[举报表格](https://pif.ephemeral.ink/partial-authenticate)。
  
  # 比赛注册和队伍建立
  - 如果您想报名参加我们的比赛，您的排名必须符合**排名限制**中列出的要求。
  - 您不允许在比赛期间将排名提升至4000名以上。如果您超出这一限制，您将会被移出比赛。
  - 如果osu!官方认定选手的水平超过这个比赛针对的选手的能力，他们可以拒绝选手参加比赛。
  - 选手需要各自报名参加比赛。当我们接到选手的注册信息，我们会在Discord的服务器中分配您的国家或地区队身份组。
  - 每个国家或地区**至少需要2位选手**参加比赛。
  - 选手所在的国家或地区（基于他们个人主页旗帜）如果没有足够的人数组建一支队伍，会被安排加入一支关联性较高的国家或地区队伍中去。
  - 如果经审查后有大于等于35个国家或地区可以参赛，每个国家或地区只允许组建1支队伍。在这种情况下，如果一个国家或地区有大于5名选手报名参赛，他们必须自行选择5名选手出战本赛事。如果未能在限定时间内决定，排名最高的5名选手将会获得参赛资格。
  - 如果小于35个国家或地区报名参赛，我们允许每个国家或地区在下列条件下组建2支队伍：
   - 您的国家或地区有**大于等于7名选手**报名。
   - 每支队伍**至少拥有3名选手**。
  - 基于上述规则，组建队伍有可能会有不同的情况：
    - 如果一个国家或地区有小于等于5名选手报名参赛，这些选手将组成代表他们国家或地区的队伍。
    - 如果一个国家或地区有大于10名选手报名参赛，他们必须自行选择10名选手并组成2支队伍出战本赛事。如果未能在限定时间内决定，排名最高的10名选手将会获得参赛资格并组成2支队伍。
    - 如果一个国家或地区有6名选手报名参赛，他们必须自行选择5名选手出战本赛事。如果未能在限定时间内决定，排名前五位的选手将会获得参赛资格。
    - 如果一个国家或地区有7-10名选手报名参赛，选手们有几天的时间决定怎么分成2支队伍。
    - 如果选手们无法达成一致意见，我们会根据PP进行排名，把选手安排在2支有至少3名选手的队伍中，排名最高的选手会在第一队，其余的选手会在第二队。
  - 我们建议选手们尽快分成2支队伍，然后决定队长人选，以便能够在最短的时间内调整比赛时间和准备比赛。
    - 选手们自行选择队伍的队长。
    - 如果选手们不能决定队长，我们将选择排名最高的选手作为队长。
    - 队长是比赛改期的负责人。他也必须确保他的队友在场比赛。
  
  # 阶段规则
  - 本赛事共有4个主要阶段：资格赛、小组赛、冒泡赛和正赛。
  - 我们将根据每支队伍在资格赛中的结果，分为4个级别：顶级，高级，低级和无级别。（更多关于分级的信息请参考资格赛介绍）
  - 资格赛排名1-8的队伍将会跳过前两周的比赛，排名9-16的队伍将会跳过第一周的比赛。
  - **小组赛**
    - 我们将于4月16日直播小组抽签。资格赛排名17-32的队伍会被分成**4个小组，每组4支队伍**。
    - 在小组赛阶段，每个小组的所有队伍都会互相对阵。**成绩最好的两支队伍**将会晋级。
    - 每支队伍的排名将根据以下优先级排序：
        - 获胜场次。
        - 净胜分。（总得分减去总失分）
        - 总得分。
        - 胜负关系。
    - 在小组赛阶段，“自动胜出”将被视作以5:0取胜，并获得1个净胜分。
  - **冒泡赛**
    - 冒泡赛是争取晋级到正赛资格的次级赛。
    - 胜者组的对阵双方是资格赛排名9-16名的队伍（第九名对阵第十六名，以此类推）
        - 这场比赛的胜者将晋级到正赛。败者将对阵败者组的胜者。
    - 败者组的对阵双方是小组赛排名第一的队伍和另一小组排名第二的队伍（A组第一对D组第二，B组第一对C组第二，C组第一对B组第二，D组第一对A组第二）。
        - 这场比赛的胜者将挑战胜者组的败者。败者被淘汰。
    - 最后一场比赛将决定谁将晋级到正赛，谁将被淘汰。
    - 败者组第二轮的比赛保持与第一部分相同的顺序（资格赛第九对第十六的败者对阵A组第一对D组第二的胜者，以此类推）。
      - 这场比赛的胜者将晋级到正赛。败者被淘汰。
  - **正赛**
    - 在这一阶段，将以经典的双败淘汰赛制进行比赛。
    - 冒泡赛胜者组的胜者将对阵资格赛排名5-8的队伍，败者组的胜者将对阵资格赛排名1-4的队伍。
    - 比赛序号以冒泡赛的倒序进行排序。头4位序号将分配给冒泡赛胜者组，而后4位序号将分配给冒泡赛败者组。（例如：序号1的比赛是由资格赛第九对第十六的胜者对阵资格赛第八。序号8的比赛是由资格赛第九对第十六的败者与A组第一对D组第二的胜者之间的胜者对阵资格赛第一。）
  - 每个阶段的胜利条件是：
    - 第一周/小组赛： 9局5胜。
    - 第二、三、四周/冒泡赛，十六强赛，胜者组八强赛、半决赛，败者组第一、二、三轮：11局6胜。
    - 第五、六周/胜者组决赛，总决赛，败者组第四、五轮、决赛：13局7胜。

  # 资格赛规则
  - 在这轮比赛中，会在不同时间段创建多个房间。
  - 裁判会创建一个私有房间，并在预定的时间邀请队伍到房间中。请确保您准时在线。
  - 本轮将不会有热身。
  - 失败的成绩将会被统计。
  - 每张谱面由队伍中的两名选手出赛。换人没有限制。
  - 所有谱面的平均排名将作为最终排名。
  - 如果两支队伍打平，每张谱面分数较高的那一轮成绩的总和，更高者排名在前。
  - 每张谱面按顺序打两轮。分数较高的那轮成绩将被用作排名。
  - 排名最高的32支队伍将会进入下一阶段。

  # 赛中规则
  - 裁判员会在比赛开始的十分钟之前建立私有房间。到了比赛时间时，裁判员会邀请两名队长进入房间，之后裁判员或者队长邀请队伍的其他选手进入房间。
  - 如果没有裁判员或者主办成员执法比赛，比赛会延期举行。
  - 如果一支队伍没有足够的选手出赛，比赛最多可以延迟十分钟。
  - 如果一支队伍不能准时进入房间，只要在延迟时间内赶到，将不会被惩罚。
  - 如果两支队伍都没有足够玩家比赛：在小组赛中， 这两支队伍会被视为输掉比赛。在冒泡赛或淘汰赛中，资格赛中排名较高的队伍会晋级。
  - 比赛会使用TeamVs和ScoreV2。比赛房间的名称是："IGTS 2023: (红队) vs (蓝队)"。
  - 每支队伍可以选择一张谱面作为热身。这张谱面不能超过三分钟，并且需要在比赛前一小时将热身谱面登记在赛事主页上。所有队伍在赛程公布当天即可以将热身谱面登记在赛事主页上。
  - 如果一支没有遵守上述规则，他们在这场比赛中将没有热身。
  - 每名队长必须禁用**一张谱面**（除了Tiebreaker），这张谱面在本场比赛之内不能被选择。
  - 每名队长使用“!roll”指令来掷骰子。
  - 获得较高点数的队伍**先选后禁**。获得较低点数的队伍**先禁后选**。
  - 每名队长有2分钟时间选择要禁用的谱面。如果未能在2分钟内选择一张谱面，将由裁判随机禁用谱面。
  - 每支队伍每场比赛可以叫一次暂停。暂停可以在任何时候使用。
  - 两名队长交替从图池中选择谱面。
  - 队长可以自由挑选所有种类的谱面。
  - 每支队伍有2分钟选择谱面，以及2分钟准备比赛。如果未能在2分钟内选择一张谱面，将由裁判随机选择谱面。
  - 在比赛期间，换人没有限制。
  - 如果有选手在谱面选择的时候断开网络连接，并且队伍中没有别的选手能代替掉线的选手，比赛最多可以延迟10分钟。每支队伍只允许延迟一次。
  - 如果玩家在游玩谱面中断开网络连接，他会被视为失败。
  - 如果有选手在谱面开始的30秒之内掉线，允许申请重赛。每支队伍只允许申请重赛一次。
  - 失败选手的得分会被计入总分。
  - 如果两支队伍在一局比赛中得分相同，该局比赛将会重赛。
  - 如果进入决胜时两支队伍比分相同（比如在9局5胜中，比分为4比4），将会使用Tiebreaker。

  # 图池介绍
  - 比赛中的每个阶段都会有一个独立的图池：资格赛、第一周、第二周、第三周、第四周、第五周和第六周。
  - 资格赛的图池会与其他阶段不同。资格赛图池包括2张NoMod、1张Hidden、1张HardRock、1张DoubleTime谱面以及1张FreeMod谱面。
  - 在同一个周末比赛的胜者组和败者组使用同一个图池。
  - 每个图池会有6个类别：NoMod、Hidden、HardRock、DoubleTime、FreeMod和Tiebreaker。
  - 第一周的图池有14张谱面。 第二周、第三周和第四周的图池有15张谱面。第五周和第六周的图池将有16张谱面。
  - 在所有阶段，Hidden、HardRock和DoubleTime有2张谱面，FreeMod有3张谱面。
  - 在第一周，NoMod有4张谱面；在第二周、第三周和第四周，有5张谱面；在第五周和第六周，有6张谱面。
  - FreeMod的图池可以自由选择Mod。每位选手可以选择使用**Hidden或HardRock或同时使用两者**。**每支队伍必须有至少一名选手使用至少一个Mod**。
  - Tiebreaker会使用FreeMod规则来比赛，但是选手不必使用Mod。
  - 每个阶段的图池会在前一个星期公布。
 
  # 赛程安排
  - 每个阶段会在**周末**进行比赛。（但是，如果两支队伍都不能在周末比赛，比赛可改到其他日期举行。）
  - 如果有足够的裁判员，可以安排多场比赛同时进行。
  - 我们将根据时区尽量把比赛安排在最佳时间进行。赛程时间表将在每个阶段的前一个周末公布。
  - 只有在两队都同意的情况下才能改期。两支队伍必须在那个星期的**国际标准时间星期四的23:59**之前决定新的比赛时间，并且附加证据通知主办成员。
  - 只有**队长**才能要求改期。

  # 全明星赛规则
  - 全明星赛是一个娱乐比赛，会和总决赛在同一个周末举行！
  这场比赛是让整个比赛中最优秀的选手互相对抗。
  - 将会以投票形式选出12名参赛选手。
  - 票数最高的12名选手将会参加全明星赛。如果一个国家或地区中有大于2名选手被选中，只有票数最高的2名选手才能参加全明星赛。
  - 票数最高的2名选手将会成为队长。其他队员会根据票数决定。排名奇数的选手将组成一队，偶数的选手将组成另一队。
  - 图池和总决赛图池相同。
  - 全明星赛将以4对4的形式进行，并有以下规则：
    - 15局8胜。
    - 比赛前不能禁用任何谱面。
    - 选择谱面的方式和正常比赛相同。
    - 选手掉线将会和正常比赛相同方式处理。
    `,
  };
  
