export default {
  name: "飞升杯全球太鼓锦标赛",
  description:
    "飞升杯全球太鼓锦标赛，是针对中等玩家的二对二比赛。限制排名在1000到4500名的选手参加。资格赛成绩最好的32支队伍将进入小组赛，随后小组成绩最好的16支队伍将晋级到双败淘汰赛。",
  links: [
    {
      label: "Discord",
      link: "https://discord.gg/3mGC3HB"
    },
    {
      label: "Challonge",
      link: "https://challonge.com/RGTS2021"
    },
    {
      label: "Pick'ems",
      link: "https://pickem.hwc.hr/tournaments/64"
    },
  ],
  homepage: [
    {
      title: "注册限制",
      body: `这个比赛允许任何排名在1000到4500名以内，并且在最近12个月之内没有被限制的选手参加。osu!官方有权力在审查阶段禁止选手参赛。`,
    },
    {
      title: "赛程",
      body: `
### 比赛注册阶段
5月15日至5月29日。
### 审查阶段
5月29日至6月6日。
### 资格赛
6月12日至6月13日。
### 小组赛
6月19日至6月20日。
### 十六强赛及败者组第一轮
6月26日至6月27日。
### 八强赛及败者组第二轮
7月3日至7月4日。
### 半决赛及败者组第三轮、第四轮
7月10日至7月11日。
### 胜者组决赛及败者组第五轮、决赛
7月17日至7月18日。
### 总决赛及全明星赛
7月24日至7月25日。`,

    },
    { title: "比赛注册", body: "首先使用osu!账号授权登录，然后点击上方的Register按钮注册，然后点击Discord按钮加入这个比赛的Discord服务器。**您必须加入Discord服务器，否则我们会将您移出比赛。**" }, 
    {
      title: "比赛奖励",
      body: `
- **第一名：**osu!个人主页徽章，每人十六个月supporter，附有冠军姓名的奖杯。
- **第二名：**每人十二个月supporter。
- **第三名：**每人六个月supporter。`,
    },
  ],
  rules: `
  # 基本规则
 - 这个比赛是一个**二对二的团体比赛**，每支队伍**最多能有5名选手**。
 - 所有队伍会先通过**资格赛**， 然后进入**小组赛**，最后进入**双败淘汰赛**。
 - 我们将使用**Score V2**作为得分系统。
 - 如果您的排名符合规定的要求，您就可以参加比赛。由于我们这次比赛可能会派发胜利者徽章，有些选手可能会被osu!官方禁止参赛。
 - 除了**组织者、图池管理员和裁判员**之外，所有主办成员都可以参加比赛。
 - 选手和主办成员必须彻底阅读规则。（我们会假定您在比赛整个过程中已经彻底了解这些规则）
 - 每名选手必须尊重所有其他选手和主办成员，以及保持适当的态度。如果您不遵守这条规则，您有可能会被禁赛或加入黑名单。这条规则也适用于所有的主办成员。
 - 任何规则改变或者意外事件会在Discord的服务器公布。

# 比赛注册和队伍建立
 - 如果您想报名参加我们的比赛，您的排名必须在1000到4500名以内。
 - 选手需要各自报名参加。当我们接到选手的注册信息，我们会在Discord的服务器中分配您的国家或地区队身份组。
 - 如果osu!官方认定选手的水平超过这个比赛针对的选手的能力，他们可以拒绝选手参加比赛。
 - 我们允许每个国家或地区在下列条件下组建2支队伍：
   - 您的国家或地区有**大于等于7名选手**报名。
   - 每支队伍**至少拥有3名选手**。
 - 基于上述规则，组建队伍有可能会有不同的情况：
   - 如果一个国家或地区有小于等于5名选手报名参加，这些选手将组成代表他们国家或地区的队伍。
   - 如果一个国家或地区有超过10名选手报名参加，将会由选手们自行决定10名出赛的选手。如果未能在限定时间内决定，排名前十位的选手将会组成2支队伍。
   - 如果一个国家或地区有6名选手报名参加，将会由选手自行决定5名出赛的选手。如果未能在限定时间内决定，排名前五位的选手将会组成1支队伍。
   - 如果一个国家或地区有7-10名选手报名参加，选手们有几天的时间决定怎么分成2支队伍。 我们建议选手们尽快分成2支队伍，然后决定队长，以便能够在最短的时间内调整比赛时间和准备比赛。
   - 如果选手们无法达成一致意见，我们会用PP进行排名，把选手安排在两支有至少3名选手的队伍，PP排名最高的选手会在第一队，其余的选手会在第二队。
   - 选手们自行决定队伍的队长。
   - 如果选手们不能决定队长，我们将选择排名最高的选手作为队长。
 - 队长是比赛改期的负责人。他也必须确保他的队友在场比赛。

# 阶段规则
 - 这次比赛共有7个阶段：资格赛、小组赛、十六强赛、八强赛、半决赛、胜者组决赛和总决赛。
 - 我们将根据每支队伍在资格赛中的结果，分为4个级别：顶级，高级，低级和无级别。（更多关于分级的信息请参考资格赛介绍）
 - 我们将于6月13日，星期天在Twitch频道直播小组抽签。**共有8个小组，每个小组中有4支队伍**。
 - 在小组赛阶段，每个小组的所有队伍都会互相对阵。**成绩最好的两支队伍**将会晋级。
 - 每支队伍的排名将根据以下优先级排序：
    - 获胜场次。
    - 净胜分。（总得分减去总失分）
    - 总得分。
    - 胜负关系。
 - 在小组赛阶段，“自动胜出”将被视作以5:0取胜，以及1个净胜分。
 - 每个阶段的胜利条件是：
   - 小组赛： 9局5胜。
   - 十六强赛、八强赛以及败者组第一轮、第二轮：11局6胜。
   - 半决赛、胜者组决赛、总决赛以及败者组第三轮、第四轮、第五轮、决赛：13局7胜。

# 资格赛规则
 - 在这轮比赛中，会在不同时间段创建多个房间。
 - 裁判会创建一个私有房间，然后队伍会在预定的时间被邀请到房间中。请确保你准时在线上。
 - 本轮将不会有热身。
 - 失败的成绩将会被统计。
 - 每个谱面将由队伍中的两名选手出赛。换人将没有限制。
 - 所有谱面的平均排名将作为最终排名。
 - 每个谱面按顺序打两次。分数较高的那轮成绩将被用作排名。
 - 排名最高的32支队伍将会进入小组赛。

# 小组赛和淘汰赛规则
 - 裁判员会在比赛开始的十分钟之前建立新房间。到了比赛时间时，裁判员将邀请两名队长进入房间，之后裁判员或者队长邀请队伍的其他选手进入房间。
 - 如果没有裁判员或者职员执法比赛，比赛会被延期举行。
 - 如果某个队伍小于两名玩家出赛，比赛可以延迟最多十分钟。
 - 如果队伍不能准时进入房间，只要在预定时间后的十分钟内到达，将不会被惩罚。
 - 如果两支队伍都没有足够玩家比赛： 在小组赛中， 这两支队伍会被视为输掉比赛。在淘汰赛中，资格赛中排名较高的队伍会晋级。
 - 比赛会使用TeamVs和ScoreV2。 比赛房间的名称是 : "RGTS 2021: (红队) vs (蓝队)"。
 - 每支队伍可以选择一张谱面作为热身。这张谱面不能超过三分钟。如果可能的话，需要在比赛前一小时将热身谱面发送给直播员。所有选手都可以进入房间热身。
 - 如果一支队伍没有遵守前一条规则，他们会被取消热身。
 - 每个队长必须禁用**一张谱面**(除了决胜局谱面），这张谱面在该场比赛之内不能被选择。
 - 每支队伍的队长使用“!roll”指令来掷骰子。
 - 获得较高点数的队伍**先选后禁**。获得较低点数的队伍**先禁后选**。
 - 每支队伍的队长将会有两分钟选择要禁用的谱面。如果未能在两分钟内选出，将会随机选择禁用的谱面。
 - 两名队长交替从图池中选择谱面。
 - 队长能自由挑选所有种类的谱面。
 - 队伍将会有两分钟选择谱面，以及两分钟准备比赛。如果队伍未能在两分钟内选择一张谱面，将会掷点随机决定。
 - 在比赛期间，换人没有限制。
 - 如果有选手在谱面选择的时候网络掉线，而且队伍没有别的选手能代替掉线的选手，比赛能够延迟最多10分钟。每支队伍只允许延迟一次。
 - 如果玩家在玩谱面中掉线，所得分数会视为失败。
 - 如果有选手在谱面开始的30秒之内断线，裁判员将允许两支队伍重开。每支队伍只允许重开一次。
 - 失败选手的得分会被计入总分。
 - 如果两支队伍在一局比赛中得分相同，该局比赛将会重赛。
 - 如果比分相同（比如在9局5胜中，比分为4比4），将会使用决胜局谱面。

# 图池介绍
 - 比赛中的每个阶段将有一个图池：资格赛、小组赛、十六强赛、八强赛、半决赛、决赛和总决赛。全明星赛将使用另外一个图池。 (详情请参考全明星赛规则）。
 - 资格赛的图池会与其他阶段不同。资格赛图池包括2张NoMod、1张Hidden、1张HardRock以及1张DoubleTime谱面。
 - 在同一个周末比赛的胜者组和败者组将使用同一个图池。
 - 每个图池会有6个类别：NoMod、Hidden、HardRock、DoubleTime、FreeMod和Tiebreaker。
 - 小组赛的图池有14张谱面。 八强赛的图池有15张谱面。半决赛 、决赛和总决赛的图池将有16张谱面。
 - 在所有阶段，Hidden、HardRock和DoubleTime有2张谱面，FreeMod有3张谱面。
 - 在小组赛阶段，NoMod有4张谱面；在十六强赛和八强赛阶段，有5张谱面；在半决赛、决赛和总决赛阶段，有6张谱面。
 - FreeMod的图池可以自由选择Mod。每位选手可以选择使用**Hidden或HardRock或同时使用两者**。**每支队伍必须有至少一名选手使用至少一个Mod**。
 - 决胜局谱面会使用FreeMod规则来比赛，但是选手不必使用Mod。
 - 每个阶段的图池会在前一个星期在Twitch频道直播。

# 赛程安排
 - 每个阶段会在**周末**进行比赛。（但是，如果两个团队都不能在周末比赛，比赛可改到其他日期举行。）
 - 如果有足够的裁判员，可以安排两个比赛同时进行。
 - 我们将根据时区尽量把比赛安排在最佳时间进行。赛程时间表将在每个阶段的前一个周末公布。
 - 只有在两队都同意的情况下才能改期。两支队伍必须在那个星期的**国际标准时间星期四的23:59**之前决定新的比赛时间，并且附加证据通知主办成员。
 - 只有**队长**才能要求改期。

# 全明星赛规则
 - 全明星赛是一个娱乐比赛，会和总决赛在同一个周末举行。 这场比赛是让整个比赛中最优秀的选手展示自己的才能。
 - 将会以投票形式选出8位参赛选手。
 - 票数最高的8位选手将会参加全明星赛。如果一个国家或地区中有多于两位选手被选中，只有票数最高的两位选手才能参加全明星赛。
 - 票数最高的两位选手将会成为队长。其他队员会根据票数决定。排名第1、3、5、7的选手将组成一队，第2、4、6、8的选手将组成另一队。
 - 图池将由一个特殊的图池管理团队选出。
 - 全明星赛将以4对4的形式进行，并有以下规则：
   - 15局8胜。
   - 图池将会有4张NoMod、4张Hidden、4张HardRock、4张Hidden-HardRock、4张DoubleTime以及1张Tiebreaker谱面。
   - 比赛前不能禁用任何谱面。
   - 选择谱面的方式和正常比赛相同。
   - 选手掉线将会和正常比赛相同方式处理。
   `,
};