export default {
  name: "Rising Global Taiko Showdown",
  description:
    "Rising Global Taiko Showdown, это турнир 2 на 2 для игроков среднего уровня, с ограничением рангов от #1,500 до #4,500. По результатам квалификаций, 32 лучшие команды сразятся в групповой стадии, где пройдут 16 команд, которые сыграют в сетке с двойным вылетом.",
  links: [
    {
      label: "Discord",
      link: "https://discord.gg/3mGC3HB"
    },
    {
      label: "Challonge",
      link: "https://challonge.com/RGTS2022"
    },
  ],
  homepage: [
    {
      title: "Ограничения",
      body: `Турнир открыт для игроков с рангом от #1,500 до #4,500. Любой игрок osu!taiko, который не получал рестрикт за последние 12 месяцев, будет допущен к турниру. osu! саппорт в праве не допустить любого игрока к турниру после скрининга.`,
    },
    {
      title: "Даты проведения",
      body: `
### Регистрации
С 10-го Октября до 23-го Октября.
### Скрининг
С 23-го Октября до 30-го Октября.
### Квалификации
С 5-го Ноября до 6-го Ноября.
### Групповой этап
С 12-го Ноября до 13-го Ноября.
### 1/8 финала
С 19-го Ноября до 20-го Ноября.
### Четверьфиналы + 1 Раунд Сетки Лузеров
С 26-го Ноября до 27-го Ноября.
### Полуфиналы + 2 и 3 Раунд Сетки Лузеров
С 3-го Декабря до 4-го Декабря.
### Финал Сетки Победителей + 4 и 5 Раунд Сетки Лузеров
С 10-го Декабря до 11-го Декабря.
### Гранд Финал + Гранд Финалы Сетки Лузеров + Матч лучших игроков
С 17-го Декабря до 18-го Декабря.`,

    },
    { title: "Регистрации", body: "Пожалуйста, нажмите на кнопку Register после того как зайдёте на свой osu! аккаунт, затем нажмите на кнопку Дискорда, чтобы зайти на сервер турнира. **Присоединение к Дискорд Серверу обязательно для участия в турнире, и вы будете исключены если не сделаете этого.**" }, 
    {
      title: "Призы",
      body: `
- **1-ое Место:** Бейдж в профиль. (В ожидании подтверждения)`,
    },
  ],
  rules: `
  # Основные Правила
 - Этот турнир представляет собой **командный турнир 2 на 2** с командами из **максимум 5 игроков**.
 - Команды сначала пройдут **квалификацию**. Затем они сыграют в **групповом этапе** и наконец в **сетке с двойным вылетом**.
 - Для подсёта очков используется **Score V2**.
 - Любой игрок отвечающий требованиям описаными в разделе ограничения по рангам имеет право зарегистрироваться. Поскольку это турнир на бейдж, некоторые игроки могут быть отклонены персоналом osu.
 - Любой участник или персонал турнира кроме **Организаторов, Маппулеров и Реффери** имеют право играть.
 - Игроки и персонал турнира обязаны полностью прочитать этот набор правил (и мы предполагаем, что вы сделали это на протяжении турнира).
 - Все участники должны оставаться уважительными и сохранять надлежащий настрой. Несоблюдение этого правила может привести к бану/добавлению в чёрный список турнира. Это правила также касается и персонала.
 - Любые изменения или необычные события будут анонсированы на Дискорд сервере.

# Регистрация на Турнир и Формирование Команд
 - Для участия в туринре ваш ранг должен быть от #1500 до #4500. 
 - После окончания регистраций, вы сможете поднять свой ранк до #1300. Если вы превысите данный лимит во время турнира, вы будете дисквалифицированны. 
 - Игроки подают заявки на участие индивидуально. Когда их заявка будет принята, они получат роль страны, за которую они выступают. 
 - Персонал имеет право отказать игроку в участии в турнире, если они заподозрят что его умения намного лучше, чем у остальных игроков в данном ранговом сегменте. 
 - В этом году мы допускаем две команды от одной страны при следующих условиях: 
   - Заявки подали **7 или более игроков** из одной страны. 
   - В каждой команде должно быть **минимум 3 игрока**. 
 - Ввиду предыдущего правила при формировании команд могут произойти следующие ситуации:  
   - Если 5 или менее игроков из одной страны подали заявки, то из этих игроков формируется команда, представляющая их страну. 
   - В случае если более 10-ти игроков из одной страны подали заявки, игрокам придётся решать между собой, кто будет участвовать в турнире. Если игроки не смогут определиться, то тогда 10 лучших по рангу игроков будут выбраны, для формирования 2-ух команд. 
   - Если заявки подадут 6 игроков из одной страны, то игрокам нужно будет выбрать 5 игроков для участия в турнире. Если игроки не смогут определиться с выбором, то тогда 5 лучших по рангу игроков будут выбраны для формирования команды.  
   - Если останется от 7-ми до 10-ти игроков из одной страны, (после исключения по рангам) подавших заявку на участие в турнире, то тогда у игроков из этой страны будет несколько дней распределить их на две команды.  
   Рекомедуется прийти к общему решению как можно быстрее, чтобы затем выбрать капитана и быть готовым назначать время матчей как можно быстрее. 
   - Если игроки не смогут прийти к общему решению, то они будут распределены по pp и разделены на две команды хотя бы по 3 игрока с лучшими игроками в одной команде, и худшими в другой.
   - Игроки должны будут выбрать капитана своей команды.  
   - Если игроки не смогут выбрать капитана, то им будет назначен игрок с самым высоким рангом. 
 - Капитан будет ответственен за перенос матчей в случае необходимости и будет обеспечивать присутствие своей команды на них.  

# Правила Стадий турнира
 - В этом турнире всего 7 стадий: Квалификация, Групповой Этап, 1/8 финала, Четвертьфиналы, Полуфиналы, Финалы и Гранд Финалы.  
 - Все команды будут распределены на 4 уровня по среднему числу, взятому из их мест на каждой карте квалификации. Эти 4 уровня: Топ сид, Хай сид, Лоу сид и Ансид. (Процесс распределения описан более подробно в "Инструкция по квалификации").  
 - Команды будут распределены на **8 групп по 4 команды** во время жеребьёвки которая будет проведена в Воскресенье, 6 Ноября 18:00 UTC.  
 - В Групповом Этапе все команды сразятся друг с другом. **2 лучшие команды** пройдут в следующую стадию.  
 - Результаты каждой группы для каждой команды будут определяться по следующим условиям:  
    - Наибольшее число выйгранных матчей.
    - Наибольшая разница между количеством выйгранных и проигранных карт. 
    - Наибольшее число выйгранных карт. 
    - Победитель прошлого сыгранного матча между командами у которых ничья.
 - Во время Группового Этапа 'Победа по умолчанию' будет считаться как победа 5:0, +1.0 соотношения разницы очков.
 - Условия победы в каждой стадии:
   - Групповой Этап : BO9 (необходимо выйграть 5 карт).
   - 1/8 финала, Четвертьфиналы и Раунды Сетки лузеров 1 и 2 : BO11 (необходимо выйграть 6 карт). 
   - Полуфиналы, Финалы, Гранд Финалы и Раунды Сетки лузеров 3 и 4 : BO13 (необходимо выйграть 7 карт). 

# Правила Квалификации
 - Во время данной стадии будет доступно множество лобби в разное время. 
 - Будет создано закрытое лобби и команды получат приглашение в него, когда настанет время лобби. Обязательно будьте в сети в это время.  
 - Разминочных карт не предусмотрено. 
 - Очки игроков, непрошедших карту идут в счёт.
 - По два человека от команды будут играть каждую карту. Нет ограничений на замену игроков.  
 - Распределение команд будет произведено по среднему числу, взятому из их мест на каждой карте.  
 - Каждая карта будет сыграна дважды. В зачёт пойдёт лучшая попытка. 
 - 32 лучшие команды пройдут в Групповой Этап.  

# Правила проведения матчей
 - За 10 минут до матча рефери создаст закрытое лобби. Капитаны обоих команд будут приглашены ко времени начала матча. Затем рефери или капитаны пригласят остальных игроков. 
 - Если не будет свободного персонала или рефери, то матч будет перенесён. 
 - Если придёт меньше минимального кол-ва игроков, начало матча может быть отложено на 10 минут максимум.
 - При опоздании, если зайти в лобби в течении 10 минут после начала матча, штрафов не будет. 
 - Если у обоих команд не будет достаточно игроков спустя 10 минут после начала матча, обоим будет засчитано поражение в Групповой Стадии. В сетке с двойным вылетом команда с лучшим сидом пройдёт дальше. 
 - Матч будет сыгран с настройками TeamVs и ScoreV2, название лобби должно быть: "RGTS 2022: (Team Red) vs (Team Blue)". 
 - Команда может поставить вармап, но он должен быть меньше 3 минут, и отправлен на сайте максимум за час до начала матча. Отправить вармап можно будет после выхода расписания матчей. Иначе команды будут без вармапа. 
 - Вармап не должен быть оскорбительным или NSFW (18+).
 - Капитан должен забанить **одну карту** из пула (кроме Тайбрейкера). Эти карты нельзя будет пикнуть обоим командам в течении всего матча. 
 - Капитаны обоих команд должны будут зароллить в чат командой "!roll". 
 - Команда с высшим роллом **банит второй и пикает парвой**. Команда с низшим роллом **банит первой и пикает второй**. 
 - Капитаны обоих команд имеют 2 минуты чтобы сообщить баны. Если в течении этого времени они не сообщат бан, то бан будет выбран роллом. 
 - После этого выбор карт из маппула будет чередоваться между капитанами. 
 - Капитаны могут свободно выбирать из любой части маппула.
 - У команд будет 2 минуты чтобы пикнуть карту, и 2 минуты чтобы подготовиться. Если в течении этого времени не сообщат пик, то пик будет выбран роллом. 
 - Смена игроков во время матча допустима без каких либо ограничений. 
 - Если игрок отключается между выбором карт и у команд нет его заменя, матч может быть задержан максимум на 10 минут. Эта задержка доступны только один раз. 
 - Если игрок отключается, то он считается как сфейливший карту. 
 - При отключении в течении 30 секунд после начала карты, карту можно переиграть. Это доступно только один раз для обоих команд. 
 - Скоры сфейливших игроков добавляются к общему скору команды. 
 - Если игра была сыгранна в ничью, то она обнуляется и переигрывается. 
 - В случае ничьи в очках (например: 4-4 в BO9) будет выбран Тайбрейкер. 

# Правила касающиеся маппула
 - Будет 1 маппул на каждую из стадий: Квалификации, Групповая Стадия, 1/8 финала, Четверьфиналы, Полуфиналы, Финалы и Гранд Финалы. 
 - Пул Квалификаций будет отличаться от других стадий и имеет следующий формат карт: 3 NoMod, 2 Hidden, 2 Hard Rock, 1 Double Time и 1 FreeMod. 
 - Сетка Лузеров будет играть на том же пуле, что и Основная Сетка на тех же выходных. 
 - Каждый маппул состоит из 6 групп: NoMod, Hidden, HardRock, DoubleTime, FreeMod и Тайбрейкер. 
 - Маппул Групповой Стадии состоит из 14 карт, 1/8 финала и Четвертьфиналы из 15 карт, Полуфиналы, Финалы и Гранд Финалы из 16 карт. 
 - Все стадии турнира будут иметь по 2 Hidden, HardRock и DoubleTime карты, и 3 FreeMod карты. 
 - Пул FreeMod играется с активированным FreeMod. Каждый игрок может выбрать **Hidden, HardRock, или оба сразу**. **Хотя бы один игрок из каждой команды должен выбрать хотя бы один мод**. 
 - Игроки должны выбрать разные комбинации модов. Оба игрока не могут иметь только Hidden, только HardRock или двойной Hidden+HardRock. 
 - Групповая Стадия будет иметь 4 NoMod карты, 1/8 финала и Четвертьфиналы - 5 NoMod карт, Полуфиналы, Финалы и Гранд Финалы - 6 NoMod карт. 
 - Тайбрейкер будет играться с FreeMod, но не обязательно иметь игрока с модом. 
 - Маппул каждой стадии будет показан за неделю до матчей. 

# Правила расписания матчей
 - Каждый этап турнира будет проводиться **по выходным**. Если во время выходных нет удобного времени для матча, разрешено провести его в другой день.  
 - Матчи могут пересекаться по времени с другими, если есть свободные судьи. 
 - Мы будем стараться выбирать лучшее время в соответствии с часовыми поясами команд. Расписание будет выложено за неделю до проведения этапа.  
 - Перенос матча будет разрешён, если обе команды будут согласны с новым временем проведения матча. Необходимо сообщить об этом персоналу и отправить им доказательства согласия команд до **Четверга в 23:59 UTC+0** той недели, на которой проводится матч.  
 - Запросить перенос матча имеет право только **капитан команды**.
 
 # Правила "Матча лучших игроков"
 - Матч лучших игроков - это весёлое событие, которое проводится на тех же выходных, что и Гранд Финалы! 
 - Это событие покажет лучших игру лучших игроков против друг друга в особом матче. 
 - 8 игроков примут участие в этом событие, которые будут выбраны голосованием. 
 - 8 лучших игроков примут участие в матче. Если среди лучших 8 есть больше 2 игроков из одной страны, только 2 лучших примут участие. 
 - 2 лучших игрока будут капитанами двух команд. Их тиммейты будут оставшиеся 6 игроков. У первого капитана будет команда из игроков с нечётным местом, у второго капитана будет команда из игроков с чётным местом. 
 - Событие будет матчем 4 на 4 с этими правилами: 
   - BO15. 
   - Маппулом будет маппул Гранд Финалов.
   - Без банов. 
   - Выбор карт будет таким же как и в обычном матче. 
   - Такие же правила при отключении как и в обычном матче. 
 `,
};