export default {
  name: "Squad Global Taiko Showdown",
  description:
    "Squad Global Taiko Showdown, это турнир 3 на 3 где игроки могут собрать свои собственные команды до 6-ти игроков. По результатам квалификаций, 32 лучшие команды сыграют в сетке с двойным вылетом. ",
  discord: "https://discord.gg/3mGC3HB",
  homepage: [
    {
      title: "Ограничения",
      body: `Ограничений по рангу и странам нет. Любой игрок osu!taiko, который не получал рестрикт за последние 12 месяцев, будет допущен к турниру. Osu! саппорт в праве не допустить любого игрока к турниру после скрининга.`,
    },
    {
      title: "Даты проведения",
      body: `
### Регистрации
С 8-го Января до 22-го Января.
### Скрининг
С 22-го Января до 29-го Января.
### Квалификации
С 4-го Февраля до 5-го Февраля.
### 1/16 финала
С 11-го Февраля до 12-го Февраля.
### 1/8 финала + 1-ый раунд нижней сетки
С 18-го Февраля до 19-го Февраля.
### Четвертьфиналы + 2-ой и 3-ий раунды нижней сетки 
С 25-го Февраля до 26-го Февраля
### Полуфиналы + 4-ый и 5-ый раунды нижней сетки
С 4-го Марта до 5-го Марта
### Финал Верхней сетки + 6-ой и 7-ой раунды нижней сетки
С 11-го Марта до 12-го Марта
### Гранд-Финал + Гранд-Финал нижней сетки
С 18-го до 19-го Марта.`,

    },
    { title: "Регистрации", body: "Пожалуйста, нажмите на кнопку Register после того как зайдёте на свой osu! аккаунт, затем нажмите на кнопку Дискорда, чтобы зайти на сервер турнира. **Присоединение к Дискорд Серверу обязательно для участия в турнире, и вы будете исключены если не сделаете этого.**" }, 
    {
      title: "Призы",
      body: `
- **1-ое Место:** Бейдж в профиль. (В ожидании подтверждения)`,
    },
  ],
  rules: `
  # Основные правила
 - Этот турнир представляет собой **командный турнир 3 на 3** с командами из **максимум 6-ти игроков**.
 - Команды сначала пройдут **квалификацию**. Затем они сыграют в **сетке с двойным вылетом**.
 - Для подсёта очков используется **Score V2**.
 - Любой игрок отвечающий требованиям описаными в разделе ограничения по рангам имеет право зарегистрироваться. Поскольку это турнир на бейдж, некоторые игроки могут быть отклонены персоналом osu.
 - Любой персонал турнира кроме **Организаторов, Маппулеров и Реффери** имеют право играть.
 - Игроки и персонал турнира обязаны полностью прочитать этот набор правил (и на протяжении турнира мы будем предполагать что вы это сделали).
 - Все участники должны оставаться уважительными и сохранять надлежащий настрой. Несоблюдение этого правила может привести к бану/добавлению в чёрный список турнира. Это правила также касается и персонала. 
 - Любые изменения или неожиданные обстоятельства будут анонсированы на Дискорд сервере.

# Регистрация на турнир и создание команд
 - Для участия необходимо состоять в команде из **3-6 игроков** по вашему выбору. Вы можете брать в команду кого угодно, кроме упомянутого стаффа и игроков, которые уже являются частью другой команды.
 - Один из участников команды должен быть капитаном. Следует определить роль капитана в команде до регистрации.
 - Капитан команды должен будет переносить матчи при необходимости, и будет ответственным за явку товарищей на матчи.
 - Чтобы зарегистрироваться, капитан должен зарегистрировать всю вашу команду с помощью кнопки "Регистрация" на главной странице. 
    - Игрок в первом слоте - капитан. Первый слот автоматически заполнится капитаном. И это причина, почему капитан должен регестрировать команду.
  - Вы должны выбрать своё имя команды.
  - Вы можете добавить свой флаг, ссылку на изображение размером 70x47. Это не обязательно, но пустой бланк означает - что флаг страны капитана будет флагом вашей команды.
 - Один из хостов даст вам роли игроков и команды в дискорде, которые являются доступом к командному чату. Это может занять некоторое время, поскольку всё это делается вручную.
 - Команды будут пронумерованны в порядке регистрации. Этот номер будет использован для вашего командного чата, как и название вашей команды, если вы не придумаете своё.

# Регламент этапов
 - В этом турнире всего 7 этапов: Квалификация, 1/16 Финала, 1/8 Финала, Четвертьфиналы, Полуфиналы, Финалы и Гранд-Финалы. 
 - Команды будут размещены по сиду, основываясь на их результатах в Отборочном этапе.
 - Условия победы для этапов:
    - 1/16 Финала, 1/8 Финала и Первый раунд сетки проигравших: Лучшие из 9 (выиграть 5 карт)
    - Четвертьфиналы, Второй и Третий раунд сетки проигравших: Лучшие из 11 (выиграть 6 карт)
    - Полуфиналы, Финалы, Гранд-Финалы, 4-ый, 5-ый, 6-ой, 7-ой раунды сетки проигравших и Гранд-Финалы сетки проигравших: Лучшие из 13 (выиграть 7 карт)

# Правила Квалификации
 - Во время данной стадии будет доступно множество лобби в разное время. 
 - Будет создано закрытое лобби и команды получат приглашение в него, когда настанет время лобби. Обязательно будьте в сети в это время.  
 - Разминочных карт не предусмотрено. 
 - Очки игроков, непрошедших карту идут в счёт.
 - По три человека от команды будут играть каждую карту. Нет ограничений на замену игроков.  
 - Распределение команд будет произведено по среднему числу, взятому из их мест на каждой карте.  
 - Каждая карта будет сыграна дважды. В зачёт пойдёт лучшая попытка. 
 - 32 лучшие команды пройдут в плей-офф.  

# Правила проведения матчей
 - Рефери создаст приватное лобби за 10 минут до вашего матча. Оба капитана команд будут приглашены в лобби в указанное время. Потом рефери, или капитаны пригласят других игроков в комнату 
 - Если не будет свободного персонала или рефери, то матч будет перенесён. 
 - Если придёт меньше минимального кол-ва игроков, начало матча может быть отложено на 10 минут максимум.
 - При опоздании, если зайти в лобби в течении 10 минут после начала матча, штрафов не будет. 
 - Если у обоих команд не будет достаточно игроков спустя 10 минут после начала матча, обоим будет засчитано поражение в Групповой Стадии. В сетке с двойным вылетом команда с лучшим сидом пройдёт дальше. 
 - Матч будет сыгран с настройками TeamVs и ScoreV2, название лобби должно быть: "SGTS 2022: (Team Red) vs (Team Blue)". 
 - Команда может поставить вармап, но он должен быть меньше 3 минут, и отправлен на сайте максимум за час до начала матча. Отправить вармап можно будет после выхода расписания матчей. Иначе команды будут без вармапа. 
 - Вармап не должен быть оскорбительным или NSFW (18+).
 - Капитан должен забанить **одну карту** из пула (кроме Тайбрейкера). Эти карты нельзя будет пикнуть обоим командам в течении всего матча. 
 - Капитаны обоих команд должны будут зароллить в чат командой "!roll". 
 - Команда с высшим роллом **банит второй и пикает парвой**. Команда с низшим роллом **банит первой и пикает второй**. 
 - Капитаны обоих команд имеют 2 минуты чтобы сообщить баны. Если в течении этого времени они не сообщат бан, то бан будет выбран роллом. 
 - После этого выбор карт из маппула будет чередоваться между капитанами. 
 - Капитаны могут свободно выбирать из любой части маппула.
 - У команд будет 2 минуты чтобы пикнуть карту, и 2 минуты чтобы подготовиться. Если в течении этого времени не сообщат пик, то пик будет выбран роллом. 
 - Смена игроков во время матча допустима без каких либо ограничений. 
 - Если игрок отключается между выбором карт и у команд нет его заменя, матч может быть задержан максимум на 10 минут. Эта задержка доступны только один раз. 
 - Если игрок отключается, то он считается как сфейливший карту. 
 - При отключении в течении 30 секунд после начала карты, карту можно переиграть. Это доступно только один раз для обоих команд. 
 - Скоры сфейливших игроков добавляются к общему скору команды. 
 - Если игра была сыгранна в ничью, то она обнуляется и переигрывается. 
 - В случае ничьи в очках (например: 4-4 в BO9) будет выбран Тайбрейкер. 

 # Правила касающиеся маппула
 - Будет 1 маппул на каждую из стадий: Квалификации, 1/16 Финала, 1/8 Финала, Четвертьфиналы, Полуфиналы, Финалы и Гранд-Финалы. 
 - Пул Квалификаций будет отличаться от других стадий и имеет следующий формат карт: 2 NoMod, 1 Hidden, 1 Hard Rock, 1 Double Time и 1 FreeMod.  
 - Нижняя сетка будет играть на том же пуле, что и Основная Сетка на тех же выходных. 
 - Каждый маппул состоит из 6 категорий: NoMod, Hidden, HardRock, DoubleTime, FreeMod и Тайбрейкер. 
 - Маппул 1/16 Финала и 1/8 Финала состоят из 14 карт, Четвертьфиналов из 15 карт, Полуфиналов, Финалов и Гранд-Финалов из 16 карт. 
 - В категории NoMod будет по 4 карты в 1/16 Финала и 1/8 Финала, по 5 карт в Четвертьфинале и по 6 карт в Полуфинале, Финале и Гранд-Финале.
 - Все стадии турнира будут иметь по 2 Hidden, HardRock и DoubleTime карты, и по 3 FreeMod карты. 
 - Категория FreeMod играется с активированным FreeMod. **Каждая команда** должна выбрать хотя бы **два мода** для карт категории FreeMod. Этими модами могут являться Hidden или Hard Rock и также **оба мода могут быть выбраны одним игроков** чтобы удовлетворить правило двух модов. 
 - Игроки должны выбрать разные комбинации модов. Оба игрока не могут иметь только Hidden, только HardRock или двойной Hidden+HardRock.
 - Тайбрейкер будет играться с FreeMod, но не обязательно иметь игрока с модом.
 - Маппул каждой стадии будет показан за неделю до матчей. 

 # Правила расписания матчей
 - Каждый этап турнира будет проводиться **по выходным**. Если во время выходных нет удобного времени для матча, разрешено провести его в другой день.  
 - Матчи могут пересекаться по времени с другими, если есть свободные судьи. 
 - Мы будем стараться выбирать лучшее время в соответствии с часовыми поясами команд. Расписание будет выложено за неделю до проведения этапа.  
 - Перенос матча будет разрешён, если обе команды будут согласны с новым временем проведения матча. Необходимо сообщить об этом персоналу и отправить им доказательства согласия команд до **Четверга в 23:59 UTC+0** той недели, на которой проводится матч.  
 - Запросить перенос матча имеет право только **капитан команды**.
 `,
};