export default {
  name: "集结杯全球太鼓锦标赛",
  description:
    "集结杯全球太鼓锦标赛，是一项三对三团体赛事，选手们可以自由组成最多6人的队伍。资格赛成绩最好的32支队伍将进行双败淘汰赛。",
  links: [
    {
      label: "Discord",
      link: "https://discord.gg/3mGC3HB"
    },
    {
      label: "Challonge",
      link: "https://challonge.com/SGTS2022"
    },
    {
      label: "Pick'ems",
      link: "https://pickem.hwc.hr/tournaments/78"
    },
  ],
  homepage: [
    {
      title: "注册限制",
      body: `这个比赛没有排名和区域限制，允许所有在最近12个月之内没有被限制的选手参加。osu!官方有权力在审查阶段禁止选手参赛。`,
    },
    {
      title: "赛程",
      body: `
### 比赛注册阶段
11月27日至12月12日。
### 审查阶段
12月12日至1月2日。
### 资格赛
1月8日至1月9日。
### 三十二强赛
1月15日至1月16日。
### 十六强赛及败者组第一轮
1月22日至1月23日。
### 八强赛及败者组第二轮、第三轮
1月29日至1月30日。
###  半决赛及败者组第四轮、第五轮
2月5日至2月6日。
### 胜者组决赛及败者组第六轮、第七轮
2月12日至2月13日。
### 败者组决赛及总决赛
2月19日至2月20日。`,
    },
    {
      title: "比赛注册",
      body:
        "首先所有队员使用osu!账号授权登录，然后队长点击上方的Register按钮注册，然后所有队员点击Discord按钮加入赛事的Discord服务器。**您必须加入Discord服务器，否则我们会将您移出比赛。**",
    },
    {
      title: "比赛奖励",
      body: `
- **第一名：**osu!个人主页徽章。`,
    },
  ],
  rules: `
# 基本规则
- 这项赛事是一项**三对三双败淘汰赛**，每支队伍**最多能有6名选手**。
- 所有队伍进行**双败淘汰赛**。
- 我们将使用**Score V2**作为得分系统。
- 如果您的排名符合规定的要求，您就可以参加比赛。由于我们这次比赛可能会派发胜利者徽章，有些选手可能会被osu!官方禁止参赛。
- 除了**组织者、图池管理员和裁判员**之外，所有主办成员都可以参加比赛。
- 选手和主办成员必须彻底阅读规则。（我们会假定您在比赛整个过程中已经彻底了解这些规则）
- 每名选手必须尊重所有其他选手和主办成员，以及保持适当的态度。如果您不遵守这条规则，您有可能会被禁赛或加入黑名单。这条规则也适用于所有的主办成员。
- 任何规则改变或者意外事件会在Discord的服务器公布。

# 比赛注册和队伍建立
 - 如果您想报名参加我们的比赛，您必须建立一支**3到6人**的队伍。除了上述提到的主办成员和已经加入其他队伍的选手以外，没有任何组队限制，
 - 每支队伍需要有一位队长，您必须在注册之前决定你们的队长。
 - 队长是比赛改期的负责人。他也必须确保他的队友在场比赛。
 - 要注册队伍，队长需要通过主页上的register按钮登录你的队伍。
   - 第一位选手是队长。它会被自动填充为正在注册的用户，这也是为什么需要队长来完成注册。
   - 您需要添加一个自定义队伍名。
   - 您可以添加一个自定义队旗，以一张70x47大小图片的链接。这并非强制要求，如果这项留空则队长的国旗将会作为队旗。
 - 主办将会给您添加discord队伍和选手角色，以及队伍频道。因为是手动添加，所以这需要一点时间。
 - 队伍会以注册顺序计数。这个计数会用于队伍频道，同时如果你们没有提交自定义队伍名时也会被用作队伍名。

# 阶段规则
- 这次比赛共有7个阶段：资格赛、三十二强赛、十六强赛、八强赛、半决赛、胜者组决赛和总决赛。
- 在资格赛中，每支队伍会以所有谱面的平均排名将作为最终排名。
- 每个阶段的胜利条件是：
    - 三十二强赛、十六强赛： 9局5胜。
    - 八强赛： 11局6胜。
    - 半决赛、决赛、总决赛： 13局7胜。
   
# 资格赛规则
 - 在这轮比赛中，会在不同时间段创建多个房间。
 - 裁判会创建一个私有房间，然后队伍会在预定的时间被邀请到房间中。请确保你准时在线上。
 - 本轮将不会有热身。
 - 所有谱面的平均排名将作为最终排名。
 - 每个谱面按顺序打两次。分数较高的那轮成绩将被用作排名。
 - 排名最高的32支队伍将会进入淘汰赛。

# 图池介绍
- 比赛中的每个阶段将有一个图池：资格赛、三十二强赛、十六强赛、八强赛、半决赛、决赛和总决赛。
- 在同一个周末比赛的胜者组和败者组将使用同一个图池。
- 资格赛的图池会与其他阶段不同。资格赛图池包括2张NoMod、1张Hidden、1张HardRock、1张DoubleTime谱面以及1张Freemod谱面。
- 每个图池会有6个类别：**NoMod、Hidden、HardRock、DoubleTime、FreeMod和Tiebreaker**。
- 三十二强赛的图池有14张谱面。十六强赛和八强赛的图池有15张谱面。半决赛到总决赛的图池将有16张谱面。
- 在三十二强赛阶段，NoMod有4张谱面；在十六强赛和八强赛阶段，有5张谱面；在半决赛到总决赛阶段，有6张谱面。
- 在比赛的所有阶段，Hidden、Hard Rock和Double Time有2张谱面,FreeMod有3张谱面。
- FreeMod的图池可以自由选择Mod。每支队伍必须使用至少两个Mod。可以使用Hidden或者Hard Rock，也可以一位选手同时使用两个Mod来达到最低要求。
- Tiebreaker谱面会使用FreeMod规则来比赛，但是选手不必使用Mod。
- 每个阶段的图池会在前一个星期在Twitch频道直播。

# 赛程安排
- 每个阶段会在**周末**进行比赛。（但是，如果不能在周末找到一个合适的时间比赛，并且经裁判同意，比赛可改到其他日期举行。）
- 我们将根据时区尽量把比赛安排在最佳时间进行。赛程时间表将在每个阶段的前一个周末公布。
- 只有在两队都同意的情况下才能改期比赛。两支队伍必须在那个星期的**国际标准时间星期四的23:59**之前决定新的比赛时间，并且通知主办成员。

# 淘汰赛规则
- 裁判员会在比赛开始的十分钟之前建立新房间。到了比赛时间时，裁判员将邀请两名队长进入房间。
- 如果没有裁判员或者其他主办成员执法比赛，比赛会被延期举行。
- 如果某支队伍小于三名玩家出赛，比赛可以延迟最多十分钟。
- 如果队伍不能准时进入房间，只要在预定时间后的十分钟内加入，将不会被惩罚。
- 如果两支队伍都没有足够玩家比赛，资格赛中排名较高的队伍将会晋级。
- 比赛会使用TeamVs和ScoreV2。 比赛房间的名称是 : "SGTS 2021: (红队) vs (蓝队)"。
- 每支队伍可以选择一张谱面作为热身。这张谱面不能超过三分钟。需要在比赛前一小时将热身谱面发送给裁判和直播员。
- 如果一支队伍没有遵守前一条规则，他们会被取消热身。
- 只有队长可以选择、禁用谱面以及掷点。
- 每位队长必须禁用**一张谱面**(除了Tiebreaker谱面），这张谱面在该场比赛之内不能被选择。
- 每支队伍的队长使用“!roll”指令来掷骰子。其他选手的指令将被无视。
- 获得较高点数的队伍**先选后禁**。获得较低点数的队伍**先禁后选**。
- 每支队伍的队长将会有两分钟选择要禁用的谱面。如果未能在两分钟内选出，将会随机选择禁用的谱面。
- 两名队长交替从图池中选择谱面。
- 队长能自由挑选所有种类的谱面。
- 队伍将会有两分钟选择谱面，以及两分钟准备。如果队伍未能在两分钟内选择一张谱面，将会随机决定。如果有选手没有在计时结束前准备，无论如何，比赛会立即开始。
- 如果有选手在两局比赛间歇时断开连接，需要另一位选手顶替他的位置。
- 如果没有其他选手顶替断开连接的选手，比赛可以中断最多10分钟。中断比赛只能使用一次。
- 如果有选手在一局比赛开始30秒后断开连接，他的成绩将不会被计入总分。
- 如果有选手在一局比赛开始的30秒之内断开连接可以申请重赛。每支队伍只允许申请重赛一次。
- 失败选手的得分会被计入总分。
- 如果两支队伍在一局比赛中得分相同，该局比赛将会重赛。如果再一次打平，会禁用这张谱面。选择这张谱面的队伍可以重新选择一张。
- 如果比分相同（比如在9局5胜中，比分为4比4），将会使用Tiebreaker谱面。
  `,
};
